const array = [
    { "地区": "黑龙江", "城市": "04510000, 哈尔滨", "经销商名称": "黑龙江森华祥众汽车销售服务有限公司" },
    { "地区": " 山东", "城市": "05340000, 德州", "经销商名称": "德州金车汇鑫汽车销售服务有限公司" },
    { "地区": "海南", "城市": "08980000, 海口", "经销商名称": "海南优步汽车服务有限公司" },
    { "地区": "内蒙古", "城市": "04760000, 赤峰", "经销商名称": "赤峰坤展汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05770002, 温州", "经销商名称": "温州鼎源亚飞汽车销售有限公司" },
    { "地区": "广东", "城市": "06680000, 茂名", "经销商名称": "茂名茂骏汽车销售有限公司" },
    { "地区": "青海", "城市": "09710000, 西宁", "经销商名称": "青海天汇茂林汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03100001, 邯郸", "经销商名称": "邯郸市捷晨汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05270000, 宿迁", "经销商名称": "江苏中汇汽车服务有限公司" },
    { "地区": "河北", "城市": "03100001, 邯郸", "经销商名称": "武安市华捷汽车销售服务有限公司" },
    { "地区": "贵州", "城市": "08520000, 遵义", "经销商名称": "遵义市千川汽车销售有限公司" },
    { "地区": "四川", "城市": "08300000, 泸州", "经销商名称": "泸州长盈汽贸有限公司" },
    { "地区": "四川", "城市": "02800000, 成都", "经销商名称": "成都兴世达汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03950000, 漯河", "经销商名称": "漯河市和顺汽车服务有限公司" },
    { "地区": "内蒙古", "城市": "04720000, 包头", "经销商名称": "包头市锐捷汽车销售有限公司" },
    { "地区": "云南", "城市": "08770001, 玉溪", "经销商名称": "玉溪坤驰汽车销售有限公司" },
    { "地区": "四川", "城市": "08270001, 巴中", "经销商名称": "巴中蓝池亿龙汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03170000, 沧州", "经销商名称": "任丘市运致汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04310000, 长春", "经销商名称": "吉林省华之诚洋悦汽车销售有限公司" },
    { "地区": "山东", "城市": "05360001, 潍坊", "经销商名称": "潍坊广潍通达贸易有限公司" },
    { "地区": "山东", "城市": "05370000, 济宁", "经销商名称": "济宁交运怡鑫汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08710001, 昆明", "经销商名称": "云南博曜昇众汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05370000, 济宁", "经销商名称": "济宁众信汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04160000, 锦州", "经销商名称": "锦州川达捷昇汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07390000, 邵阳", "经销商名称": "邵阳达美捷众汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05100001, 无锡", "经销商名称": "无锡东方凯宏汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07580000, 肇庆", "经销商名称": "肇庆市安捷汽车有限公司" },
    { "地区": "江苏", "城市": "05150000, 盐城", "经销商名称": "盐城涌鑫众达汽车销售服务有限公司" },
    { "地区": "贵州", "城市": "08570000, 毕节", "经销商名称": "毕节荣贵顺泰汽车贸易有限公司" },
    { "地区": "广东", "城市": "07550000, 深圳", "经销商名称": "深圳市奇建捷众贸易有限公司" },
    { "地区": "福建", "城市": "05950001, 泉州", "经销商名称": "泉州明车贸易有限公司" },
    { "地区": "河南", "城市": "03790000, 洛阳", "经销商名称": "洛阳岳捷汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05160001, 徐州", "经销商名称": "徐州金拓汽车贸易有限公司" },
    { "地区": "四川", "城市": "08170000, 南充", "经销商名称": "南充明云缘运车业有限公司" },
    { "地区": "山东", "城市": "05350004, 烟台", "经销商名称": "烟台市旺源汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03780000, 开封", "经销商名称": "开封市万锦汽车贸易有限公司" },
    { "地区": "云南", "城市": "08710001, 昆明", "经销商名称": "昆明谊友汽车销售有限公司" },
    { "地区": "四川", "城市": "08330001, 眉山", "经销商名称": "眉山新众汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05430000, 滨州", "经销商名称": "滨州市金捷汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05790000, 金华", "经销商名称": "金华众意汽车销售有限公司" },
    { "地区": "山东", "城市": "06330000, 日照", "经销商名称": "日照众德汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07380001, 娄底", "经销商名称": "娄底达美捷众汽车贸易有限公司" },
    { "地区": "河南", "城市": "03760000, 信阳", "经销商名称": "信阳合众致泽汽车销售服务有限公司" },
    { "地区": "北京", "城市": "01000000, 北京", "经销商名称": "北京鑫万维顺达汽车销售有限公司" },
    { "地区": "四川", "城市": "08250000, 遂宁", "经销商名称": "遂宁弘博一众车业有限公司" },
    { "地区": "河南", "城市": "03960000, 驻马店", "经销商名称": "驻马店市和韵汽车销售有限公司" },
    { "地区": "山东", "城市": "05340000, 德州", "经销商名称": "夏津金车汇津汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "03550000, 长治", "经销商名称": "长治市飞路达汽车销售服务有限公司" },
    { "地区": "四川", "城市": "08180001, 达州", "经销商名称": "达州市弘讯汽车销售有限公司" },
    { "地区": "河南", "城市": "03710001, 郑州", "经销商名称": "河南合众汇泽汽车销售有限公司" },
    { "地区": "山东", "城市": "05300000, 菏泽", "经销商名称": "菏泽金泓汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "07100001, 襄阳", "经销商名称": "襄阳东富百捷汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08750000, 保山", "经销商名称": "保山市恒众汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "02900001, 咸阳", "经销商名称": "陕西恒睿汽贸有限公司" },
    { "地区": "辽宁", "城市": "04120000, 鞍山", "经销商名称": "鞍山新生达汽车销售有限公司" },
    { "地区": "天津", "城市": "02200000, 天津", "经销商名称": "天津恒泰通汽车销售有限公司" },
    { "地区": "安徽", "城市": "05580001, 阜阳", "经销商名称": "阜阳市永众汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04110000, 大连", "经销商名称": "大连华诺汽车贸易有限公司" },
    { "地区": "安徽", "城市": "05520000, 蚌埠", "经销商名称": "蚌埠市涌润汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08830001, 临沧", "经销商名称": "临沧益众汽车服务有限公司" },
    { "地区": "河南", "城市": "03940000, 周口", "经销商名称": "周口市和正汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03110000, 石家庄", "经销商名称": "石家庄市冀中众盛汽车贸易有限公司" },
    { "地区": "河北", "城市": "03190000, 邢台", "经销商名称": "邢台蓝池鼎龙汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04290000, 葫芦岛", "经销商名称": "辽宁川通汽车修理服务有限公司" },
    { "地区": "黑龙江", "城市": "04540000, 佳木斯", "经销商名称": "佳木斯安捷汽车销售服务有限公司" },
    { "地区": "四川", "城市": "08130000, 自贡", "经销商名称": "自贡市新众汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "04530001, 牡丹江", "经销商名称": "牡丹江中信恒威汽车销售服务有限公司" },
    { "地区": "上海", "城市": "02100000, 上海", "经销商名称": "上海华星鸿驰汽车销售服务有限公司" },
    { "地区": "贵州", "城市": "08520000, 遵义", "经销商名称": "遵义市千贵汽车销售有限公司" },
    { "地区": "湖北", "城市": "07170000, 宜昌", "经销商名称": "宜昌和顺汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "04510000, 哈尔滨", "经销商名称": "黑龙江龙海鑫达汽车销售服务有限公司" },
    { "地区": "天津", "城市": "02200000, 天津", "经销商名称": "天津通达津宝汽车维修服务有限公司" },
    { "地区": "辽宁", "城市": "04210000, 朝阳", "经销商名称": "朝阳川达汽车销售有限公司" },
    { "地区": "山东", "城市": "06350000, 聊城", "经销商名称": "聊城北斗恒捷汽车销售有限公司" },
    { "地区": "辽宁", "城市": "04170001, 营口", "经销商名称": "营口红运瑞众汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04310000, 长春", "经销商名称": "吉林省国兴汽车经贸有限公司" },
    { "地区": "河南", "城市": "03740000, 许昌", "经销商名称": "许昌恒晟业汽车销售有限公司" },
    { "地区": "重庆", "城市": "02300000, 重庆", "经销商名称": "重庆万家众信汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03120000, 保定", "经销商名称": "保定市宏众汽车贸易有限公司" },
    { "地区": "吉林", "城市": "04350000, 通化", "经销商名称": "通化市融展嘉鹏汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03120000, 保定", "经销商名称": "曲阳铭众汽车贸易有限公司" },
    { "地区": "安徽", "城市": "05570001, 宿州", "经销商名称": "宿州市晟源汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05770002, 温州", "经销商名称": "平阳县荣升汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04180000, 阜新", "经销商名称": "阜新达兴汽车销售服务有限公司" },
    { "地区": "四川", "城市": "02800000, 成都", "经销商名称": "成都博曜众达汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07540000, 汕头", "经销商名称": "汕头市华昌电子科技有限公司" },
    { "地区": "湖北", "城市": "07240001, 荆门", "经销商名称": "荆门东富百捷汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07590000, 湛江", "经销商名称": "湛江市正佳汽车贸易有限公司" },
    { "地区": "陕西", "城市": "09110000, 延安", "经销商名称": "延安捷之泰汽贸有限责任公司" },
    { "地区": "四川", "城市": "08170000, 南充", "经销商名称": "阆中明云惠诚车业有限公司" },
    { "地区": "安徽", "城市": "05640000, 六安", "经销商名称": "六安和新汽车销售服务有限责任公司" },
    { "地区": "河北", "城市": "03120000, 保定", "经销商名称": "保定市盟众汽车贸易有限公司" },
    { "地区": "贵州", "城市": "08510000, 贵阳", "经销商名称": "贵州兴众扬汽车销售服务有限责任公司" },
    { "地区": "辽宁", "城市": "02400000, 沈阳", "经销商名称": "辽宁润兴汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05180000, 连云港", "经销商名称": "连云港翔临汽车销售有限公司" },
    { "地区": "山东", "城市": "05430000, 滨州", "经销商名称": "邹平市金凯汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04370000, 辽源", "经销商名称": "辽源市耀鑫汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03700000, 商丘", "经销商名称": "商丘市新捷汽车销售有限公司" },
    { "地区": "陕西", "城市": "02900000, 西安", "经销商名称": "西安捷祥源汽车销售服务有限公司" },
    { "地区": "福建", "城市": "05940000, 莆田", "经销商名称": "莆田捷奇汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05740001, 宁波", "经销商名称": "宁波中基甬捷汽车销售服务有限公司" },
    { "地区": "甘肃", "城市": "09330000, 平凉", "经销商名称": "平凉润捷安达汽车贸易有限责任公司" },
    { "地区": "浙江", "城市": "05760001, 台州", "经销商名称": "台州市奥丰汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "02900000, 西安", "经销商名称": "西安鹰之杰尊荣汽车销售有限公司" },
    { "地区": "湖北", "城市": "07190000, 十堰", "经销商名称": "十堰东富百捷汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05460000, 东营", "经销商名称": "东营鑫锐达汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "02700001, 武汉", "经销商名称": "武汉东富百捷汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05390000, 临沂", "经销商名称": "平邑瑞华汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "02700001, 武汉", "经销商名称": "武汉东富千捷汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05320000, 青岛", "经销商名称": "青岛信和汽车销售有限公司" },
    { "地区": "云南", "城市": "08720000, 大理", "经销商名称": "大理裕田汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05730000, 嘉兴", "经销商名称": "嘉兴东晨汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "09170000, 宝鸡", "经销商名称": "宝鸡福德纳汽车销售服务有限公司" },
    { "地区": "北京", "城市": "01000000, 北京", "经销商名称": "北京捷亚泰博兴汽车销售有限公司" },
    { "地区": "吉林", "城市": "04360000, 白城", "经销商名称": "白城汇达汽车销售服务有限公司" },
    { "地区": "内蒙古", "城市": "04730000, 乌海", "经销商名称": "乌海市鑫安意通汽贸有限公司" },
    { "地区": "湖北", "城市": "07140000, 黄石", "经销商名称": "黄石市鑫辰汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03180000, 衡水", "经销商名称": "衡水宏腾汽车贸易有限公司" },
    { "地区": "新疆", "城市": "09970000, 阿克苏", "经销商名称": "阿克苏博众汽车销售有限公司" },
    { "地区": "河南", "城市": "03960000, 驻马店", "经销商名称": "驻马店市和旭汽车销售有限公司" },
    { "地区": "浙江", "城市": "05710001, 杭州", "经销商名称": "浙江百瑞广业汽车有限公司" },
    { "地区": "浙江", "城市": "05740001, 宁波", "经销商名称": "宁波轿辰众捷汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "04520000, 齐齐哈尔", "经销商名称": "齐齐哈尔粤华捷诚汽车销售有限公司" },
    { "地区": "新疆", "城市": "09990001, 伊犁", "经销商名称": "伊犁伊运汽车销售服务有限公司" },
    { "地区": "贵州", "城市": "08530000, 安顺", "经销商名称": "贵州骏隆顺达汽车销售有限公司" },
    { "地区": "陕西", "城市": "03530000, 阳泉", "经销商名称": "阳泉市捷鑫汽车销售有限公司" },
    { "地区": "河南", "城市": "03730000, 新乡", "经销商名称": "新乡市恩达汽车销售有限公司" },
    { "地区": "宁夏", "城市": "09510000, 银川", "经销商名称": "宁夏瑞泰嘉达汽车销售有限责任公司" },
    { "地区": "内蒙古", "城市": "04700001, 呼伦贝尔", "经销商名称": "呼伦贝尔市粤华众诚汽车销售有限公司" },
    { "地区": "山东", "城市": "05300000, 菏泽", "经销商名称": "菏泽金涌车业有限公司" },
    { "地区": "重庆", "城市": "02300000, 重庆", "经销商名称": "重庆慧禹汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "09160000, 汉中", "经销商名称": "汉中瑞捷汽车销售服务有限公司" },
    { "地区": "贵州", "城市": "08590009, 黔西南", "经销商名称": "贵州骏隆通达汽车销售有限公司" },
    { "地区": "内蒙古", "城市": "04750000, 通辽", "经销商名称": "通辽市利丰泰奇汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07560000, 珠海", "经销商名称": "珠海市钜荣汽车销售服务有限公司" },
    { "地区": "山东", "城市": "06320000, 枣庄", "经销商名称": "枣庄鲁汇汽车销售服务有限公司" },
    { "地区": "重庆", "城市": "02300000, 重庆", "经销商名称": "重庆宇德汽车销售有限公司" },
    { "地区": "陕西", "城市": "03590000, 运城", "经销商名称": "运城市瑞宝汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03700000, 商丘", "经销商名称": "商丘市明德汽车销售有限公司" },
    { "地区": "山东", "城市": "05360001, 潍坊", "经销商名称": "青州广潍通达汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07520000, 惠州", "经销商名称": "惠州市金瑞欣捷迅汽车销售有限公司" },
    { "地区": "吉林", "城市": "04330001, 延吉", "经销商名称": "延吉华之诚昊威汽车销售服务有限公司" },
    { "地区": "甘肃", "城市": "09310000, 兰州", "经销商名称": "兰州金岛瑞达汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03940000, 周口", "经销商名称": "周口市和明汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05310000, 济南", "经销商名称": "山东成欣汽车贸易有限公司" },
    { "地区": "山东", "城市": "05310000, 济南", "经销商名称": "山东百瑞汽车销售服务有限公司" },
    { "地区": "内蒙古", "城市": "04710000, 呼和浩特", "经销商名称": "内蒙古亿阳汇达汽车销售有限公司" },
    { "地区": "四川", "城市": "08330000, 乐山", "经销商名称": "乐山天牛新潞汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05330000, 淄博", "经销商名称": "淄博久通汽车维修服务有限公司" },
    { "地区": "新疆", "城市": "09910000, 乌鲁木齐", "经销商名称": "新疆天汇鑫瑞达汽车销售服务有限公司" },
    { "地区": "江西", "城市": "07960000, 吉安", "经销商名称": "吉安易轩锦汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05700001, 衢州", "经销商名称": "衢州福龙汽车有限公司" },
    { "地区": "贵州", "城市": "08570002, 黔东南", "经销商名称": "贵州骏隆富达汽车销售有限公司" },
    { "地区": "四川", "城市": "08310001, 宜宾", "经销商名称": "宜宾万庆众新汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07500000, 江门", "经销商名称": "江门市钜荣汽车贸易有限公司" },
    { "地区": "重庆", "城市": "02300000, 重庆", "经销商名称": "重庆绚腾汽车销售服务有限公司" },
    { "地区": "四川", "城市": "08260001, 广安", "经销商名称": "广安万成众捷汽车销售服务有限公司" },
    { "地区": "广西", "城市": "07720000, 柳州", "经销商名称": "柳州华柳华腾汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03750001, 平顶山", "经销商名称": "平顶山捷祥源汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05380000, 泰安", "经销商名称": "泰安金岳骏捷汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03150001, 唐山", "经销商名称": "唐山新华夏润田汽车租赁连锁有限公司" },
    { "地区": "河南", "城市": "03710001, 郑州", "经销商名称": "郑州捷祥源汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07360000, 常德", "经销商名称": "常德裕生捷汽车服务有限公司" },
    { "地区": "广东", "城市": "02000001, 广州", "经销商名称": "广东东瑞汽车服务有限公司" },
    { "地区": "河南", "城市": "03730000, 新乡", "经销商名称": "新乡市鸿愿汽车销售有限公司" },
    { "地区": "广东", "城市": "07690000, 东莞", "经销商名称": "东莞市车友汽车服务有限公司" },
    { "地区": "陕西", "城市": "03580000, 吕梁", "经销商名称": "山西省吕梁市大昌汽车贸易有限公司" },
    { "地区": "河北", "城市": "03190000, 邢台", "经销商名称": "清河县蓝池恒龙汽车销售服务有限公司" },
    { "地区": "广西", "城市": "07750000, 贵港", "经销商名称": "广西贵港丰裕汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08760000, 文山", "经销商名称": "文山捷惠永祥汽车销售有限公司" },
    { "地区": "陕西", "城市": "03510000, 太原", "经销商名称": "山西中盛瑞泽贸易有限公司" },
    { "地区": "河南", "城市": "03770000, 南阳", "经销商名称": "南阳万通博捷汽车销售服务有限公司" },
    { "地区": "山东", "城市": "06310001, 威海", "经销商名称": "威海远誉汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03720000, 安阳", "经销商名称": "安阳市众捷汽车贸易有限责任公司" },
    { "地区": "内蒙古", "城市": "04770000, 鄂尔多斯", "经销商名称": "鄂尔多斯市新欣汽车销售服务有限公司" },
    { "地区": "天津", "城市": "02200000, 天津", "经销商名称": "天津瀛众汽车销售有限公司" },
    { "地区": "陕西", "城市": "03520000, 大同", "经销商名称": "大同市顺旺汽车服务有限公司" },
    { "地区": "四川", "城市": "02800000, 成都", "经销商名称": "成都市泰鸿锦程汽车贸易有限责任公司" },
    { "地区": "广东", "城市": "07510000, 韶关", "经销商名称": "韶关市华南九州汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03930000, 濮阳", "经销商名称": "濮阳市德捷汽车销售服务有限公司" },
    { "地区": "江西", "城市": "07930000, 上饶", "经销商名称": "上饶市欧亚豪胜汽车服务有限公司" },
    { "地区": "湖北", "城市": "07130000, 黄冈", "经销商名称": "黄冈捷诚汽车服务有限公司" },
    { "地区": "陕西", "城市": "09120000, 榆林", "经销商名称": "榆林市恒祥汽贸有限公司" },
    { "地区": "山东", "城市": "05390000, 临沂", "经销商名称": "临沂文华汽车销售服务有限公司" },
    { "地区": "福建", "城市": "05980000, 三明", "经销商名称": "三明市成捷汽车销售服务有限公司" },
    { "地区": "新疆", "城市": "09960001, 巴音郭楞", "经销商名称": "巴州万禾博众汽车销售有限公司" },
    { "地区": "云南", "城市": "08880002, 西双版纳", "经销商名称": "西双版纳兴捷汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "04590000, 大庆", "经销商名称": "大庆世腾运达汽车销售有限公司" },
    { "地区": "安徽", "城市": "05510000, 合肥", "经销商名称": "安徽捷众汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "07220000, 随州", "经销商名称": "随州东富千捷汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05170000, 淮安", "经销商名称": "淮安市金捷汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "07180000, 恩施", "经销商名称": "恩施汇鑫达汽车销售服务有限公司" },
    { "地区": "江西", "城市": "07990000, 萍乡", "经销商名称": "萍乡金昌实业有限公司" },
    { "地区": "山东", "城市": "05320000, 青岛", "经销商名称": "青岛同众汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07450000, 怀化", "经销商名称": "怀化德广汽车销售服务有限公司" },
    { "地区": "福建", "城市": "05910000, 福州", "经销商名称": "福州明车贸易有限公司" },
    { "地区": "四川", "城市": "08340002, 凉山", "经销商名称": "西昌康龙聚诚汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07310000, 长沙", "经销商名称": "湖南捷之信汽车销售有限公司" },
    { "地区": "甘肃", "城市": "09350001, 武威", "经销商名称": "武威市永凯瑞汽车贸易有限公司" },
    { "地区": "福建", "城市": "05920000, 厦门", "经销商名称": "厦门明车贸易有限公司" },
    { "地区": "河北", "城市": "03170000, 沧州", "经销商名称": "泊头市运欣汽车销售有限公司" },
    { "地区": "内蒙古", "城市": "04740000, 乌兰察布", "经销商名称": "乌兰察布市众捷汽车销售服务有限公司" },
    { "地区": "安徽", "城市": "05580000, 亳州", "经销商名称": "亳州市盛欣汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07340000, 衡阳", "经销商名称": "衡阳捷之兴汽车销售有限公司" },
    { "地区": "广东", "城市": "07690000, 东莞", "经销商名称": "东莞市东富捷盛汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08790001, 普洱", "经销商名称": "普洱益众汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05780000, 丽水", "经销商名称": "丽水百腾汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03160000, 廊坊", "经销商名称": "廊坊首越汽车销售有限公司" },
    { "地区": "贵州", "城市": "08560000, 铜仁", "经销商名称": "贵州骏隆瑞达汽车销售有限公司" },
    { "地区": "新疆", "城市": "09980001, 喀什", "经销商名称": "喀什通工众捷汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08730001, 红河", "经销商名称": "红河捷瑞汽车销售有限公司" },
    { "地区": "广西", "城市": "07730000, 桂林", "经销商名称": "桂林华众达汽车销售有限公司" },
    { "地区": "河北", "城市": "03170000, 沧州", "经销商名称": "沧州运生汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "04560001, 黑河", "经销商名称": "北安市粤华捷安汽车销售有限公司" },
    { "地区": "河北", "城市": "03140000, 承德", "经销商名称": "承德市庞大众腾汽车销售有限公司" },
    { "地区": "辽宁", "城市": "04270000, 盘锦", "经销商名称": "盘锦伯驹汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07350000, 郴州", "经销商名称": "郴州致捷汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07620001, 河源", "经销商名称": "河源市汇盈丰汽车销售有限公司" },
    { "地区": "福建", "城市": "05960001, 漳州", "经销商名称": "漳州明车贸易有限公司" },
    { "地区": "河南", "城市": "03980000, 三门峡", "经销商名称": "三门峡旗致汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07300000, 岳阳", "经销商名称": "岳阳盛达汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07310000, 长沙", "经销商名称": "湖南兰天天达汽车销售有限公司" },
    { "地区": "河北", "城市": "03110000, 石家庄", "经销商名称": "石家庄晨阳悦众汽车贸易有限公司" },
    { "地区": "河南", "城市": "03710001, 郑州", "经销商名称": "河南合众汇正汽车销售有限公司" },
    { "地区": "广东", "城市": "07600000, 中山", "经销商名称": "中山市世捷汽车有限公司" },
    { "地区": "山东", "城市": "05330000, 淄博", "经销商名称": "淄博齐之福汽车销售有限公司" },
    { "地区": "海南", "城市": "08980003, 三亚", "经销商名称": "三亚优步汽车服务有限公司" },
    { "地区": "江苏", "城市": "05140000, 泰州", "经销商名称": "泰州东联汽车贸易有限公司" },
    { "地区": "江苏", "城市": "05130000, 南通", "经销商名称": "江苏太平洋汽车集团永兴有限公司" },
    { "地区": "安徽", "城市": "05500000, 滁州", "经销商名称": "滁州华众力捷汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "07120000, 孝感", "经销商名称": "孝感国星汽车销售服务有限公司" },
    { "地区": "江西", "城市": "07970000, 赣州", "经销商名称": "赣州融合汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04340000, 四平", "经销商名称": "四平汇达汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03780000, 开封", "经销商名称": "开封市万盈汽车贸易有限公司" },
    { "地区": "广西", "城市": "07710000, 南宁", "经销商名称": "广西钜荣粤桂汽车贸易有限公司" },
    { "地区": "河南", "城市": "03920000, 鹤壁", "经销商名称": "鹤壁市众捷汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "07280003, 天门", "经销商名称": "天门爱捷汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05760001, 台州", "经销商名称": "临海市奥丰汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03700000, 商丘", "经销商名称": "永城市新捷汽车销售服务有限公司" },
    { "地区": "山东", "城市": "05310000, 济南", "经销商名称": "山东金万通汽车销售有限公司" },
    { "地区": "河北", "城市": "03350000, 秦皇岛", "经销商名称": "秦皇岛庞大信远汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08740000, 曲靖", "经销商名称": "曲靖添福源福众汽车贸易有限公司" },
    { "地区": "贵州", "城市": "08540009, 黔南", "经销商名称": "都匀众成汽车销售服务有限公司" },
    { "地区": "安徽", "城市": "05550000, 马鞍山", "经销商名称": "马鞍山润中汽车服务有限公司" },
    { "地区": "湖北", "城市": "07150000, 咸宁", "经销商名称": "咸宁东旗汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "03490000, 朔州", "经销商名称": "朔州市双良惠众汽车有限公司" },
    { "地区": "江苏", "城市": "05120002, 苏州", "经销商名称": "昆山永众汽车销售服务有限公司" },
    { "地区": "内蒙古", "城市": "04760000, 赤峰", "经销商名称": "赤峰人和凯富达汽车销售有限公司" },
    { "地区": "安徽", "城市": "05540000, 淮南", "经销商名称": "淮南盛州汽车销售服务有限公司" },
    { "地区": "上海", "城市": "02100000, 上海", "经销商名称": "上海华星鸿全汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05120002, 苏州", "经销商名称": "苏州捷众汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05750000, 绍兴", "经销商名称": "绍兴捷盛清风汽车销售有限公司" },
    { "地区": "河北", "城市": "03130000, 张家口", "经销商名称": "张家口德捷汽车销售有限公司" },
    { "地区": "山东", "城市": "05350004, 烟台", "经销商名称": "烟台亿辰汽车俱乐部有限公司" },
    { "地区": "四川", "城市": "08320001, 资阳", "经销商名称": "资阳市兴昌荣车辆销售有限公司" },
    { "地区": "山东", "城市": "05390000, 临沂", "经销商名称": "沂水韶华汽车销售服务有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "莒南德华汽车销售服务有限公司" },
    { "地区": "广东", "城市": "深圳", "经销商名称": "深圳市北奇建贸易有限公司" },
    { "地区": "内蒙古", "城市": "04780000, 巴彦淖尔", "经销商名称": "巴彦淖尔市航宇汽车销售有限责任公司" },
    { "地区": "四川", "城市": "08350001, 雅安", "经销商名称": "四川众捷础双汽车贸易有限公司" },
    { "地区": "河北", "城市": "03150001, 唐山", "经销商名称": "乐亭县荣腾汽车销售有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "兰陵大华汽车销售服务有限公司" },
    { "地区": "河南", "城市": "03910000, 焦作", "经销商名称": "焦作市天捷汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08700001, 昭通", "经销商名称": "昭通谊众汽车销售有限公司" },
    { "地区": "湖北", "城市": "07280001, 潜江", "经销商名称": "潜江益众汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05710001, 杭州", "经销商名称": "杭州百腾新业汽车销售有限公司" },
    { "地区": "安徽", "城市": "05560000, 安庆", "经销商名称": "安庆市众捷汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "04550001, 绥化", "经销商名称": "绥化众捷汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07330000, 株洲", "经销商名称": "株洲宏旺汽车销售服务有限公司" },
    { "地区": "上海", "城市": "上海", "经销商名称": "上海华星鸿捷汽车销售服务有限公司" },
    { "地区": "安徽", "城市": "阜阳", "经销商名称": "阜阳永迪汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "金华", "经销商名称": "东阳市众富汽车销售服务有限公司" },
    { "地区": "福建", "城市": "福州", "经销商名称": "福州致远汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "杭州", "经销商名称": "浙江百腾汽车有限公司" },
    { "地区": "江苏", "城市": "无锡", "经销商名称": "无锡市新纪元众友汽车销售服务有限公司" },
    { "地区": "河南", "城市": "许昌", "经销商名称": "禹州恒业汽车销售有限公司" },
    { "地区": "山东", "城市": "菏泽", "经销商名称": "菏泽金浤车业有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "临沂德华汽车销售服务有限公司" },
    { "地区": "福建", "城市": "泉州", "经销商名称": "惠安盈众汽车销售服务有限公司" },
    { "地区": "福建", "城市": "厦门", "经销商名称": "厦门君达汽车有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "费县大华汽车销售服务有限公司" },
    { "地区": "上海", "城市": "02100000, 上海", "经销商名称": "上海华星鸿通汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "徐州", "经销商名称": "徐州金宇汽车贸易有限公司" },
    { "地区": "四川", "城市": "08320000, 内江", "经销商名称": "内江蓝池亿龙汽车销售服务有限公司" },
    { "地区": "山东", "城市": "枣庄", "经销商名称": "山东永正集团东联汽车城有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "临沂大华汽车销售服务有限公司" },
    { "地区": "广东", "城市": "深圳", "经销商名称": "深圳市奇建贸易有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "临沭东华汽车销售服务有限公司" },
    { "地区": "福建", "城市": "厦门", "经销商名称": "厦门市盈众汽车销售有限公司" },
    { "地区": "内蒙古", "城市": "04790009, 锡林郭勒盟", "经销商名称": "锡林郭勒盟新途汽车销售服务有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "沂南大华汽车销售服务有限公司" },
    { "地区": "山东", "城市": "潍坊", "经销商名称": "临朐广潍顺达汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "徐州", "经销商名称": "徐州金源汽车服务有限公司" },
    { "地区": "辽宁", "城市": "04130000, 抚顺", "经销商名称": "抚顺志兴汽车销售服务有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "临沂久华汽车销售服务有限公司" },
    { "地区": "福建", "城市": "厦门", "经销商名称": "厦门市海沧盈众汽车有限公司" },
    { "地区": "山东", "城市": "潍坊", "经销商名称": "昌邑广潍金达汽车销售服务有限公司" },
    { "地区": "河南", "城市": "信阳", "经销商名称": "信阳合众致成汽车销售服务有限公司" },
    { "地区": "河北", "城市": "常德", "经销商名称": "常德澄冬汽车销售有限公司" },
    { "地区": "山东", "城市": "临沂", "经销商名称": "郯城大华汽车销售服务有限公司" },
    { "地区": "河南", "城市": "许昌", "经销商名称": "长葛市恒业汽车销售有限公司" },
    { "地区": "福建", "城市": "厦门", "经销商名称": "厦门致远汽车有限公司" },
    { "地区": "广东", "城市": "02000001, 广州", "经销商名称": "广东健达汽车科技有限公司" },
    { "地区": "河北", "城市": "邢台", "经销商名称": "邢台瑞龙汽车服务有限公司" },
    { "地区": "新疆", "城市": "09940000, 昌吉", "经销商名称": "昌吉骏腾瑞欣汽车销售有限公司" },
    { "地区": "黑龙江", "城市": "04670000, 鸡西", "经销商名称": "鸡西名派汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "03500000, 忻州", "经销商名称": "忻州大昌轿车销售有限公司" },
    { "地区": "陕西", "城市": "03570001, 临汾", "经销商名称": "临汾海通汽车销售有限公司" },
    { "地区": "湖北", "城市": "武汉", "经销商名称": "武汉富尔汽车销售服务有限公司" },
    { "地区": "湖北", "城市": "07160000, 荆州", "经销商名称": "荆州益华汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05740001, 宁波", "经销商名称": "宁波中基慈捷汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04310000, 长春", "经销商名称": "长春汇祥亿达汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04380000, 松原", "经销商名称": "松原汇达汽车销售服务有限公司" },
    { "地区": "河北", "城市": "邢台", "经销商名称": "邢台亿龙汽车销售服务有限公司" },
    { "地区": "浙江", "城市": "05720000, 湖州", "经销商名称": "湖州百捷汽车有限公司" },
    { "地区": "江西", "城市": "07910000, 南昌", "经销商名称": "江西众捷汽车服务有限公司" },
    { "地区": "广东", "城市": "02000001, 广州", "经销商名称": "广州南菱大捷汽车有限公司" },
    { "地区": "甘肃", "城市": "09380000, 天水", "经销商名称": "天水天合华捷汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07320000, 湘潭", "经销商名称": "湘潭捷众汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "02400000, 沈阳", "经销商名称": "沈阳捷众汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "07460000, 永州", "经销商名称": "永州益捷汽车服务有限公司" },
    { "地区": "湖南", "城市": "07370001, 益阳", "经销商名称": "益阳晓园汽车销售服务有限公司" },
    { "地区": "河北", "城市": "邢台", "经销商名称": "富锦安诚汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04110000, 大连", "经销商名称": "瓦房店立博贸易有限公司" },
    { "地区": "河南", "城市": "新乡", "经销商名称": "长垣世通汽车贸易有限公司" },
    { "地区": "浙江", "城市": "05790000, 金华", "经销商名称": "义乌市众豪汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "05110001, 镇江", "经销商名称": "镇江中汇汽车服务有限公司" },
    { "地区": "陕西", "城市": "03560000, 晋城", "经销商名称": "晋城海联捷成汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "03510000, 太原", "经销商名称": "太原海联捷丰汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07550000, 深圳", "经销商名称": "深圳市奇建捷盛贸易有限公司" },
    { "地区": "黑龙江", "城市": "大兴安岭", "经销商名称": "大兴安岭龙海兴众汽车销售服务有限公司" },
    { "地区": "江苏", "城市": "02500000, 南京", "经销商名称": "南京宏众汽车销售有限公司" },
    { "地区": "广东", "城市": "07570000, 佛山", "经销商名称": "佛山市建安汽车销售服务有限公司" },
    { "地区": "四川", "城市": "02800000, 成都", "经销商名称": "成都泰鸿众捷汽车有限公司" },
    { "地区": "陕西", "城市": "03540000, 晋中", "经销商名称": "晋中市金悦汽车服务有限公司" },
    { "地区": "陕西", "城市": "榆林", "经销商名称": "府谷县恒捷汽贸有限公司" },
    { "地区": "吉林", "城市": "04320000, 吉林", "经销商名称": "吉林市神捷汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "咸阳", "经销商名称": "咸阳恒源汽贸有限公司" },
    { "地区": "福建", "城市": "05970000, 龙岩", "经销商名称": "龙岩明车贸易有限公司" },
    { "地区": "河北", "城市": "03130000, 张家口", "经销商名称": "张家口捷润汽车销售有限公司" },
    { "地区": "辽宁", "城市": "营口", "经销商名称": "营口红运顺众汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "榆林", "经销商名称": "靖边县恒博汽贸有限公司" },
    { "地区": "广西", "城市": "07750001, 玉林", "经销商名称": "玉林优步汽车销售服务有限公司" },
    { "地区": "河南", "城市": "新乡", "经销商名称": "辉县市世通汽车销售有限公司" },
    { "地区": "河南", "城市": "03710001, 郑州", "经销商名称": "郑州捷祥达汽车销售服务有限公司" },
    { "地区": "内蒙古", "城市": "04820001, 兴安", "经销商名称": "兴安盟华达汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04100000, 铁岭", "经销商名称": "铁岭承兴汽车销售服务有限公司" },
    { "地区": "广西", "城市": "07720000, 柳州", "经销商名称": "柳州华柳华达汽车销售服务有限公司" },
    { "地区": "吉林", "城市": "04310000, 长春", "经销商名称": "吉林省华商汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03110000, 石家庄", "经销商名称": "石家庄晨阳和悦汽车贸易有限公司" },
    { "地区": "天津", "城市": "02200000, 天津", "经销商名称": "天津恒信通汽车销售有限公司" },
    { "地区": "黑龙江", "城市": "04690000, 双鸭山", "经销商名称": "双鸭山安硕汽车销售服务有限公司" },
    { "地区": "云南", "城市": "06910004, 德宏", "经销商名称": "德宏捷泰汽车销售有限公司" },
    { "地区": "甘肃", "城市": "09430001, 白银", "经销商名称": "白银易成汽车销售有限公司" },
    { "地区": "河北", "城市": "03110000, 石家庄", "经销商名称": "石家庄市浩众汽车贸易有限公司" },
    { "地区": "安徽", "城市": "05610000, 淮北", "经销商名称": "淮北市晟昌汽车销售服务有限责任公司" },
    { "地区": "贵州", "城市": "08510000, 贵阳", "经销商名称": "贵州新威扬汽车服务有限公司" },
    { "地区": "四川", "城市": "08380000, 德阳", "经销商名称": "德阳远鸿汽车销售服务有限公司" },
    { "地区": "陕西", "城市": "09130001, 渭南", "经销商名称": "渭南恒盛捷达汽贸有限公司" },
    { "地区": "江西", "城市": "07950000, 宜春", "经销商名称": "宜春益众汽车贸易有限公司" },
    { "地区": "四川", "城市": "02800000, 成都", "经销商名称": "成都博曜昱众汽车销售服务有限公司" },
    { "地区": "广西", "城市": "07700001, 防城港", "经销商名称": "广西防城港丰捷汽车销售服务有限公司" },
    { "地区": "四川", "城市": "08160000, 绵阳", "经销商名称": "绵阳博曜昱达汽车销售服务有限公司" },
    { "地区": "云南", "城市": "08880001, 丽江", "经销商名称": "丽江鑫驰骏汽车销售服务有限责任公司" },
    { "地区": "广西", "城市": "07760001, 百色", "经销商名称": "广西百色丰裕汽车销售服务有限公司" },
    { "地区": "广西", "城市": "07710000, 南宁", "经销商名称": "广西钜荣粤桂汽车有限公司" },
    { "地区": "福建", "城市": "05990001, 南平", "经销商名称": "南平明车贸易有限公司" },
    { "地区": "河南", "城市": "03760000, 信阳", "经销商名称": "信阳合众致正汽车销售服务有限公司" },
    { "地区": "广西", "城市": "07770001, 钦州", "经销商名称": "钦州祥辰汽车销售服务有限公司" },
    { "地区": "广东", "城市": "07520000, 惠州", "经销商名称": "惠州南菱通达汽车有限公司" },
    { "地区": "陕西", "城市": "09130001, 渭南", "经销商名称": "渭南恒盛德丰汽贸有限公司" },
    { "地区": "西藏", "城市": "08910000, 拉萨", "经销商名称": "拉萨康捷汽车销售服务有限公司" },
    { "地区": "河北", "城市": "03110000, 石家庄", "经销商名称": "石家庄晨阳卓悦汽车贸易有限公司" },
    { "地区": "陕西", "城市": "09190001, 铜川", "经销商名称": "铜川捷泰汽贸有限责任公司" },
    { "地区": "福建", "城市": "宁德", "经销商名称": "宁德盈众汽车有限公司" },
    { "地区": "吉林", "城市": "白山", "经销商名称": "白山市众合汽车销售维修有限国内公司" },
    { "地区": "甘肃", "城市": "09360001, 张掖", "经销商名称": "张掖金岛恒达汽车销售服务有限公司" },
    { "地区": "黑龙江", "城市": "七台河市", "经销商名称": "七台河市龙海汇众汽车销售服务有限公司" },
    { "地区": "辽宁", "城市": "04190000, 辽阳", "经销商名称": "辽阳凯达汽车销售服务有限公司" },
    { "地区": "甘肃", "城市": "金昌", "经销商名称": "金昌赛亚汇通汽车销售服务有限公司" },
    { "地区": "甘肃", "城市": "09370001, 酒泉", "经销商名称": "酒泉金岛诚达汽车销售服务有限公司" },
    { "地区": "广东", "城市": "06620001, 阳江", "经销商名称": "阳江市源捷汽车销售服务有限公司" },
    { "地区": "湖南", "城市": "邵阳", "经销商名称": "邵阳大汉汽车贸易有限公司" },
    { "地区": "广东", "城市": "07570000, 佛山", "经销商名称": "广东广物华旭汽车贸易有限公司" },
    { "地区": "辽宁", "城市": "本溪", "经销商名称": "辽宁惠华集团本溪汽车销售服务有限公司" },
];

function formatData(array, key) {
    const formatObj = {};
    let code = 0;
    array.forEach(ele => {
        if (key === '城市') {
            const keyArr = ele[key].split(',');
            if (keyArr.length > 1) {
                ele[key] = keyArr[1];
            }
        }
        if (!formatObj[ele[key]]) {
            formatObj[ele[key]] = [ele];
        } else {
            formatObj[ele[key]].push(ele);
        }
    });
    return formatObj;
}

function myTrim(str) {
    str = str.replace(/\s+/g, '');
    str = str.replace(/[\r\n]/g,"");
    return str;
}

const obj = formatData(array, '地区');

const resObj = [];
let code = 0;
for (const key in obj) {
    const item = obj[key];
    const citysObj = formatData(item, '城市');
    const childrenArr = [];
    for (const subKey in citysObj) {
        const cityArr = citysObj[subKey];
        const jxsArr = [];
        cityArr.forEach(subELe => {
            jxsArr.push({
                name: myTrim(subELe['经销商名称']),
                code: code++
            });
        });
        childrenArr.push({
            name: myTrim(subKey),
            code: code++,
            children: jxsArr
        });
    }
    resObj.push({
        name: myTrim(key),
        code: code++,
        children: childrenArr
    });
}
console.log(JSON.stringify(resObj));



[
    {
        "name":"黑龙江",
        "code":23,
        "children":[
            {
                "name":"哈尔滨",
                "code":2,
                "children":[
                    {
                        "name":"黑龙江森华祥众汽车销售服务有限公司",
                        "code":0
                    },
                    {
                        "name":"黑龙江龙海鑫达汽车销售服务有限公司",
                        "code":1
                    }
                ]
            },
            {
                "name":"佳木斯",
                "code":4,
                "children":[
                    {
                        "name":"佳木斯安捷汽车销售服务有限公司",
                        "code":3
                    }
                ]
            },
            {
                "name":"牡丹江",
                "code":6,
                "children":[
                    {
                        "name":"牡丹江中信恒威汽车销售服务有限公司",
                        "code":5
                    }
                ]
            },
            {
                "name":"齐齐哈尔",
                "code":8,
                "children":[
                    {
                        "name":"齐齐哈尔粤华捷诚汽车销售有限公司",
                        "code":7
                    }
                ]
            },
            {
                "name":"大庆",
                "code":10,
                "children":[
                    {
                        "name":"大庆世腾运达汽车销售有限公司",
                        "code":9
                    }
                ]
            },
            {
                "name":"黑河",
                "code":12,
                "children":[
                    {
                        "name":"北安市粤华捷安汽车销售有限公司",
                        "code":11
                    }
                ]
            },
            {
                "name":"绥化",
                "code":14,
                "children":[
                    {
                        "name":"绥化众捷汽车销售服务有限公司",
                        "code":13
                    }
                ]
            },
            {
                "name":"鸡西",
                "code":16,
                "children":[
                    {
                        "name":"鸡西名派汽车销售服务有限公司",
                        "code":15
                    }
                ]
            },
            {
                "name":"大兴安岭",
                "code":18,
                "children":[
                    {
                        "name":"大兴安岭龙海兴众汽车销售服务有限公司",
                        "code":17
                    }
                ]
            },
            {
                "name":"双鸭山",
                "code":20,
                "children":[
                    {
                        "name":"双鸭山安硕汽车销售服务有限公司",
                        "code":19
                    }
                ]
            },
            {
                "name":"七台河市",
                "code":22,
                "children":[
                    {
                        "name":"七台河市龙海汇众汽车销售服务有限公司",
                        "code":21
                    }
                ]
            }
        ]
    },
    {
        "name":"山东",
        "code":26,
        "children":[
            {
                "name":"德州",
                "code":25,
                "children":[
                    {
                        "name":"德州金车汇鑫汽车销售服务有限公司",
                        "code":24
                    }
                ]
            }
        ]
    },
    {
        "name":"海南",
        "code":31,
        "children":[
            {
                "name":"海口",
                "code":28,
                "children":[
                    {
                        "name":"海南优步汽车服务有限公司",
                        "code":27
                    }
                ]
            },
            {
                "name":"三亚",
                "code":30,
                "children":[
                    {
                        "name":"三亚优步汽车服务有限公司",
                        "code":29
                    }
                ]
            }
        ]
    },
    {
        "name":"内蒙古",
        "code":55,
        "children":[
            {
                "name":"赤峰",
                "code":34,
                "children":[
                    {
                        "name":"赤峰坤展汽车销售服务有限公司",
                        "code":32
                    },
                    {
                        "name":"赤峰人和凯富达汽车销售有限公司",
                        "code":33
                    }
                ]
            },
            {
                "name":"包头",
                "code":36,
                "children":[
                    {
                        "name":"包头市锐捷汽车销售有限公司",
                        "code":35
                    }
                ]
            },
            {
                "name":"乌海",
                "code":38,
                "children":[
                    {
                        "name":"乌海市鑫安意通汽贸有限公司",
                        "code":37
                    }
                ]
            },
            {
                "name":"呼伦贝尔",
                "code":40,
                "children":[
                    {
                        "name":"呼伦贝尔市粤华众诚汽车销售有限公司",
                        "code":39
                    }
                ]
            },
            {
                "name":"通辽",
                "code":42,
                "children":[
                    {
                        "name":"通辽市利丰泰奇汽车销售服务有限公司",
                        "code":41
                    }
                ]
            },
            {
                "name":"呼和浩特",
                "code":44,
                "children":[
                    {
                        "name":"内蒙古亿阳汇达汽车销售有限公司",
                        "code":43
                    }
                ]
            },
            {
                "name":"鄂尔多斯",
                "code":46,
                "children":[
                    {
                        "name":"鄂尔多斯市新欣汽车销售服务有限公司",
                        "code":45
                    }
                ]
            },
            {
                "name":"乌兰察布",
                "code":48,
                "children":[
                    {
                        "name":"乌兰察布市众捷汽车销售服务有限公司",
                        "code":47
                    }
                ]
            },
            {
                "name":"巴彦淖尔",
                "code":50,
                "children":[
                    {
                        "name":"巴彦淖尔市航宇汽车销售有限责任公司",
                        "code":49
                    }
                ]
            },
            {
                "name":"锡林郭勒盟",
                "code":52,
                "children":[
                    {
                        "name":"锡林郭勒盟新途汽车销售服务有限公司",
                        "code":51
                    }
                ]
            },
            {
                "name":"兴安",
                "code":54,
                "children":[
                    {
                        "name":"兴安盟华达汽车销售服务有限公司",
                        "code":53
                    }
                ]
            }
        ]
    },
    {
        "name":"浙江",
        "code":86,
        "children":[
            {
                "name":"温州",
                "code":58,
                "children":[
                    {
                        "name":"温州鼎源亚飞汽车销售有限公司",
                        "code":56
                    },
                    {
                        "name":"平阳县荣升汽车销售服务有限公司",
                        "code":57
                    }
                ]
            },
            {
                "name":"金华",
                "code":61,
                "children":[
                    {
                        "name":"金华众意汽车销售有限公司",
                        "code":59
                    },
                    {
                        "name":"义乌市众豪汽车销售服务有限公司",
                        "code":60
                    }
                ]
            },
            {
                "name":"宁波",
                "code":65,
                "children":[
                    {
                        "name":"宁波中基甬捷汽车销售服务有限公司",
                        "code":62
                    },
                    {
                        "name":"宁波轿辰众捷汽车销售服务有限公司",
                        "code":63
                    },
                    {
                        "name":"宁波中基慈捷汽车销售服务有限公司",
                        "code":64
                    }
                ]
            },
            {
                "name":"台州",
                "code":68,
                "children":[
                    {
                        "name":"台州市奥丰汽车销售服务有限公司",
                        "code":66
                    },
                    {
                        "name":"临海市奥丰汽车销售服务有限公司",
                        "code":67
                    }
                ]
            },
            {
                "name":"嘉兴",
                "code":70,
                "children":[
                    {
                        "name":"嘉兴东晨汽车销售服务有限公司",
                        "code":69
                    }
                ]
            },
            {
                "name":"杭州",
                "code":73,
                "children":[
                    {
                        "name":"浙江百瑞广业汽车有限公司",
                        "code":71
                    },
                    {
                        "name":"杭州百腾新业汽车销售有限公司",
                        "code":72
                    }
                ]
            },
            {
                "name":"衢州",
                "code":75,
                "children":[
                    {
                        "name":"衢州福龙汽车有限公司",
                        "code":74
                    }
                ]
            },
            {
                "name":"丽水",
                "code":77,
                "children":[
                    {
                        "name":"丽水百腾汽车销售服务有限公司",
                        "code":76
                    }
                ]
            },
            {
                "name":"绍兴",
                "code":79,
                "children":[
                    {
                        "name":"绍兴捷盛清风汽车销售有限公司",
                        "code":78
                    }
                ]
            },
            {
                "name":"金华",
                "code":81,
                "children":[
                    {
                        "name":"东阳市众富汽车销售服务有限公司",
                        "code":80
                    }
                ]
            },
            {
                "name":"杭州",
                "code":83,
                "children":[
                    {
                        "name":"浙江百腾汽车有限公司",
                        "code":82
                    }
                ]
            },
            {
                "name":"湖州",
                "code":85,
                "children":[
                    {
                        "name":"湖州百捷汽车有限公司",
                        "code":84
                    }
                ]
            }
        ]
    },
    {
        "name":"广东",
        "code":126,
        "children":[
            {
                "name":"茂名",
                "code":88,
                "children":[
                    {
                        "name":"茂名茂骏汽车销售有限公司",
                        "code":87
                    }
                ]
            },
            {
                "name":"肇庆",
                "code":90,
                "children":[
                    {
                        "name":"肇庆市安捷汽车有限公司",
                        "code":89
                    }
                ]
            },
            {
                "name":"深圳",
                "code":93,
                "children":[
                    {
                        "name":"深圳市奇建捷众贸易有限公司",
                        "code":91
                    },
                    {
                        "name":"深圳市奇建捷盛贸易有限公司",
                        "code":92
                    }
                ]
            },
            {
                "name":"汕头",
                "code":95,
                "children":[
                    {
                        "name":"汕头市华昌电子科技有限公司",
                        "code":94
                    }
                ]
            },
            {
                "name":"湛江",
                "code":97,
                "children":[
                    {
                        "name":"湛江市正佳汽车贸易有限公司",
                        "code":96
                    }
                ]
            },
            {
                "name":"珠海",
                "code":99,
                "children":[
                    {
                        "name":"珠海市钜荣汽车销售服务有限公司",
                        "code":98
                    }
                ]
            },
            {
                "name":"惠州",
                "code":102,
                "children":[
                    {
                        "name":"惠州市金瑞欣捷迅汽车销售有限公司",
                        "code":100
                    },
                    {
                        "name":"惠州南菱通达汽车有限公司",
                        "code":101
                    }
                ]
            },
            {
                "name":"江门",
                "code":104,
                "children":[
                    {
                        "name":"江门市钜荣汽车贸易有限公司",
                        "code":103
                    }
                ]
            },
            {
                "name":"广州",
                "code":108,
                "children":[
                    {
                        "name":"广东东瑞汽车服务有限公司",
                        "code":105
                    },
                    {
                        "name":"广东健达汽车科技有限公司",
                        "code":106
                    },
                    {
                        "name":"广州南菱大捷汽车有限公司",
                        "code":107
                    }
                ]
            },
            {
                "name":"东莞",
                "code":111,
                "children":[
                    {
                        "name":"东莞市车友汽车服务有限公司",
                        "code":109
                    },
                    {
                        "name":"东莞市东富捷盛汽车销售服务有限公司",
                        "code":110
                    }
                ]
            },
            {
                "name":"韶关",
                "code":113,
                "children":[
                    {
                        "name":"韶关市华南九州汽车销售服务有限公司",
                        "code":112
                    }
                ]
            },
            {
                "name":"河源",
                "code":115,
                "children":[
                    {
                        "name":"河源市汇盈丰汽车销售有限公司",
                        "code":114
                    }
                ]
            },
            {
                "name":"中山",
                "code":117,
                "children":[
                    {
                        "name":"中山市世捷汽车有限公司",
                        "code":116
                    }
                ]
            },
            {
                "name":"深圳",
                "code":120,
                "children":[
                    {
                        "name":"深圳市北奇建贸易有限公司",
                        "code":118
                    },
                    {
                        "name":"深圳市奇建贸易有限公司",
                        "code":119
                    }
                ]
            },
            {
                "name":"佛山",
                "code":123,
                "children":[
                    {
                        "name":"佛山市建安汽车销售服务有限公司",
                        "code":121
                    },
                    {
                        "name":"广东广物华旭汽车贸易有限公司",
                        "code":122
                    }
                ]
            },
            {
                "name":"阳江",
                "code":125,
                "children":[
                    {
                        "name":"阳江市源捷汽车销售服务有限公司",
                        "code":124
                    }
                ]
            }
        ]
    },
    {
        "name":"青海",
        "code":129,
        "children":[
            {
                "name":"西宁",
                "code":128,
                "children":[
                    {
                        "name":"青海天汇茂林汽车销售服务有限公司",
                        "code":127
                    }
                ]
            }
        ]
    },
    {
        "name":"河北",
        "code":170,
        "children":[
            {
                "name":"邯郸",
                "code":132,
                "children":[
                    {
                        "name":"邯郸市捷晨汽车销售服务有限公司",
                        "code":130
                    },
                    {
                        "name":"武安市华捷汽车销售服务有限公司",
                        "code":131
                    }
                ]
            },
            {
                "name":"沧州",
                "code":136,
                "children":[
                    {
                        "name":"任丘市运致汽车销售服务有限公司",
                        "code":133
                    },
                    {
                        "name":"泊头市运欣汽车销售有限公司",
                        "code":134
                    },
                    {
                        "name":"沧州运生汽车销售服务有限公司",
                        "code":135
                    }
                ]
            },
            {
                "name":"石家庄",
                "code":142,
                "children":[
                    {
                        "name":"石家庄市冀中众盛汽车贸易有限公司",
                        "code":137
                    },
                    {
                        "name":"石家庄晨阳悦众汽车贸易有限公司",
                        "code":138
                    },
                    {
                        "name":"石家庄晨阳和悦汽车贸易有限公司",
                        "code":139
                    },
                    {
                        "name":"石家庄市浩众汽车贸易有限公司",
                        "code":140
                    },
                    {
                        "name":"石家庄晨阳卓悦汽车贸易有限公司",
                        "code":141
                    }
                ]
            },
            {
                "name":"邢台",
                "code":145,
                "children":[
                    {
                        "name":"邢台蓝池鼎龙汽车销售服务有限公司",
                        "code":143
                    },
                    {
                        "name":"清河县蓝池恒龙汽车销售服务有限公司",
                        "code":144
                    }
                ]
            },
            {
                "name":"保定",
                "code":149,
                "children":[
                    {
                        "name":"保定市宏众汽车贸易有限公司",
                        "code":146
                    },
                    {
                        "name":"曲阳铭众汽车贸易有限公司",
                        "code":147
                    },
                    {
                        "name":"保定市盟众汽车贸易有限公司",
                        "code":148
                    }
                ]
            },
            {
                "name":"衡水",
                "code":151,
                "children":[
                    {
                        "name":"衡水宏腾汽车贸易有限公司",
                        "code":150
                    }
                ]
            },
            {
                "name":"唐山",
                "code":154,
                "children":[
                    {
                        "name":"唐山新华夏润田汽车租赁连锁有限公司",
                        "code":152
                    },
                    {
                        "name":"乐亭县荣腾汽车销售有限公司",
                        "code":153
                    }
                ]
            },
            {
                "name":"廊坊",
                "code":156,
                "children":[
                    {
                        "name":"廊坊首越汽车销售有限公司",
                        "code":155
                    }
                ]
            },
            {
                "name":"承德",
                "code":158,
                "children":[
                    {
                        "name":"承德市庞大众腾汽车销售有限公司",
                        "code":157
                    }
                ]
            },
            {
                "name":"秦皇岛",
                "code":160,
                "children":[
                    {
                        "name":"秦皇岛庞大信远汽车销售服务有限公司",
                        "code":159
                    }
                ]
            },
            {
                "name":"张家口",
                "code":163,
                "children":[
                    {
                        "name":"张家口德捷汽车销售有限公司",
                        "code":161
                    },
                    {
                        "name":"张家口捷润汽车销售有限公司",
                        "code":162
                    }
                ]
            },
            {
                "name":"常德",
                "code":165,
                "children":[
                    {
                        "name":"常德澄冬汽车销售有限公司",
                        "code":164
                    }
                ]
            },
            {
                "name":"邢台",
                "code":169,
                "children":[
                    {
                        "name":"邢台瑞龙汽车服务有限公司",
                        "code":166
                    },
                    {
                        "name":"邢台亿龙汽车销售服务有限公司",
                        "code":167
                    },
                    {
                        "name":"富锦安诚汽车销售服务有限公司",
                        "code":168
                    }
                ]
            }
        ]
    },
    {
        "name":"江苏",
        "code":199,
        "children":[
            {
                "name":"宿迁",
                "code":172,
                "children":[
                    {
                        "name":"江苏中汇汽车服务有限公司",
                        "code":171
                    }
                ]
            },
            {
                "name":"无锡",
                "code":174,
                "children":[
                    {
                        "name":"无锡东方凯宏汽车销售服务有限公司",
                        "code":173
                    }
                ]
            },
            {
                "name":"盐城",
                "code":176,
                "children":[
                    {
                        "name":"盐城涌鑫众达汽车销售服务有限公司",
                        "code":175
                    }
                ]
            },
            {
                "name":"徐州",
                "code":178,
                "children":[
                    {
                        "name":"徐州金拓汽车贸易有限公司",
                        "code":177
                    }
                ]
            },
            {
                "name":"连云港",
                "code":180,
                "children":[
                    {
                        "name":"连云港翔临汽车销售有限公司",
                        "code":179
                    }
                ]
            },
            {
                "name":"淮安",
                "code":182,
                "children":[
                    {
                        "name":"淮安市金捷汽车销售服务有限公司",
                        "code":181
                    }
                ]
            },
            {
                "name":"泰州",
                "code":184,
                "children":[
                    {
                        "name":"泰州东联汽车贸易有限公司",
                        "code":183
                    }
                ]
            },
            {
                "name":"南通",
                "code":186,
                "children":[
                    {
                        "name":"江苏太平洋汽车集团永兴有限公司",
                        "code":185
                    }
                ]
            },
            {
                "name":"苏州",
                "code":189,
                "children":[
                    {
                        "name":"昆山永众汽车销售服务有限公司",
                        "code":187
                    },
                    {
                        "name":"苏州捷众汽车销售服务有限公司",
                        "code":188
                    }
                ]
            },
            {
                "name":"无锡",
                "code":191,
                "children":[
                    {
                        "name":"无锡市新纪元众友汽车销售服务有限公司",
                        "code":190
                    }
                ]
            },
            {
                "name":"徐州",
                "code":194,
                "children":[
                    {
                        "name":"徐州金宇汽车贸易有限公司",
                        "code":192
                    },
                    {
                        "name":"徐州金源汽车服务有限公司",
                        "code":193
                    }
                ]
            },
            {
                "name":"镇江",
                "code":196,
                "children":[
                    {
                        "name":"镇江中汇汽车服务有限公司",
                        "code":195
                    }
                ]
            },
            {
                "name":"南京",
                "code":198,
                "children":[
                    {
                        "name":"南京宏众汽车销售有限公司",
                        "code":197
                    }
                ]
            }
        ]
    },
    {
        "name":"贵州",
        "code":218,
        "children":[
            {
                "name":"遵义",
                "code":202,
                "children":[
                    {
                        "name":"遵义市千川汽车销售有限公司",
                        "code":200
                    },
                    {
                        "name":"遵义市千贵汽车销售有限公司",
                        "code":201
                    }
                ]
            },
            {
                "name":"毕节",
                "code":204,
                "children":[
                    {
                        "name":"毕节荣贵顺泰汽车贸易有限公司",
                        "code":203
                    }
                ]
            },
            {
                "name":"贵阳",
                "code":207,
                "children":[
                    {
                        "name":"贵州兴众扬汽车销售服务有限责任公司",
                        "code":205
                    },
                    {
                        "name":"贵州新威扬汽车服务有限公司",
                        "code":206
                    }
                ]
            },
            {
                "name":"安顺",
                "code":209,
                "children":[
                    {
                        "name":"贵州骏隆顺达汽车销售有限公司",
                        "code":208
                    }
                ]
            },
            {
                "name":"黔西南",
                "code":211,
                "children":[
                    {
                        "name":"贵州骏隆通达汽车销售有限公司",
                        "code":210
                    }
                ]
            },
            {
                "name":"黔东南",
                "code":213,
                "children":[
                    {
                        "name":"贵州骏隆富达汽车销售有限公司",
                        "code":212
                    }
                ]
            },
            {
                "name":"铜仁",
                "code":215,
                "children":[
                    {
                        "name":"贵州骏隆瑞达汽车销售有限公司",
                        "code":214
                    }
                ]
            },
            {
                "name":"黔南",
                "code":217,
                "children":[
                    {
                        "name":"都匀众成汽车销售服务有限公司",
                        "code":216
                    }
                ]
            }
        ]
    },
    {
        "name":"四川",
        "code":258,
        "children":[
            {
                "name":"泸州",
                "code":220,
                "children":[
                    {
                        "name":"泸州长盈汽贸有限公司",
                        "code":219
                    }
                ]
            },
            {
                "name":"成都",
                "code":226,
                "children":[
                    {
                        "name":"成都兴世达汽车销售服务有限公司",
                        "code":221
                    },
                    {
                        "name":"成都博曜众达汽车销售服务有限公司",
                        "code":222
                    },
                    {
                        "name":"成都市泰鸿锦程汽车贸易有限责任公司",
                        "code":223
                    },
                    {
                        "name":"成都泰鸿众捷汽车有限公司",
                        "code":224
                    },
                    {
                        "name":"成都博曜昱众汽车销售服务有限公司",
                        "code":225
                    }
                ]
            },
            {
                "name":"巴中",
                "code":228,
                "children":[
                    {
                        "name":"巴中蓝池亿龙汽车销售服务有限公司",
                        "code":227
                    }
                ]
            },
            {
                "name":"南充",
                "code":231,
                "children":[
                    {
                        "name":"南充明云缘运车业有限公司",
                        "code":229
                    },
                    {
                        "name":"阆中明云惠诚车业有限公司",
                        "code":230
                    }
                ]
            },
            {
                "name":"眉山",
                "code":233,
                "children":[
                    {
                        "name":"眉山新众汽车销售服务有限公司",
                        "code":232
                    }
                ]
            },
            {
                "name":"遂宁",
                "code":235,
                "children":[
                    {
                        "name":"遂宁弘博一众车业有限公司",
                        "code":234
                    }
                ]
            },
            {
                "name":"达州",
                "code":237,
                "children":[
                    {
                        "name":"达州市弘讯汽车销售有限公司",
                        "code":236
                    }
                ]
            },
            {
                "name":"自贡",
                "code":239,
                "children":[
                    {
                        "name":"自贡市新众汽车销售服务有限公司",
                        "code":238
                    }
                ]
            },
            {
                "name":"乐山",
                "code":241,
                "children":[
                    {
                        "name":"乐山天牛新潞汽车销售服务有限公司",
                        "code":240
                    }
                ]
            },
            {
                "name":"宜宾",
                "code":243,
                "children":[
                    {
                        "name":"宜宾万庆众新汽车销售服务有限公司",
                        "code":242
                    }
                ]
            },
            {
                "name":"广安",
                "code":245,
                "children":[
                    {
                        "name":"广安万成众捷汽车销售服务有限公司",
                        "code":244
                    }
                ]
            },
            {
                "name":"凉山",
                "code":247,
                "children":[
                    {
                        "name":"西昌康龙聚诚汽车销售服务有限公司",
                        "code":246
                    }
                ]
            },
            {
                "name":"资阳",
                "code":249,
                "children":[
                    {
                        "name":"资阳市兴昌荣车辆销售有限公司",
                        "code":248
                    }
                ]
            },
            {
                "name":"雅安",
                "code":251,
                "children":[
                    {
                        "name":"四川众捷础双汽车贸易有限公司",
                        "code":250
                    }
                ]
            },
            {
                "name":"内江",
                "code":253,
                "children":[
                    {
                        "name":"内江蓝池亿龙汽车销售服务有限公司",
                        "code":252
                    }
                ]
            },
            {
                "name":"德阳",
                "code":255,
                "children":[
                    {
                        "name":"德阳远鸿汽车销售服务有限公司",
                        "code":254
                    }
                ]
            },
            {
                "name":"绵阳",
                "code":257,
                "children":[
                    {
                        "name":"绵阳博曜昱达汽车销售服务有限公司",
                        "code":256
                    }
                ]
            }
        ]
    },
    {
        "name":"河南",
        "code":311,
        "children":[
            {
                "name":"漯河",
                "code":260,
                "children":[
                    {
                        "name":"漯河市和顺汽车服务有限公司",
                        "code":259
                    }
                ]
            },
            {
                "name":"洛阳",
                "code":262,
                "children":[
                    {
                        "name":"洛阳岳捷汽车销售服务有限公司",
                        "code":261
                    }
                ]
            },
            {
                "name":"开封",
                "code":265,
                "children":[
                    {
                        "name":"开封市万锦汽车贸易有限公司",
                        "code":263
                    },
                    {
                        "name":"开封市万盈汽车贸易有限公司",
                        "code":264
                    }
                ]
            },
            {
                "name":"信阳",
                "code":268,
                "children":[
                    {
                        "name":"信阳合众致泽汽车销售服务有限公司",
                        "code":266
                    },
                    {
                        "name":"信阳合众致正汽车销售服务有限公司",
                        "code":267
                    }
                ]
            },
            {
                "name":"驻马店",
                "code":271,
                "children":[
                    {
                        "name":"驻马店市和韵汽车销售有限公司",
                        "code":269
                    },
                    {
                        "name":"驻马店市和旭汽车销售有限公司",
                        "code":270
                    }
                ]
            },
            {
                "name":"郑州",
                "code":276,
                "children":[
                    {
                        "name":"河南合众汇泽汽车销售有限公司",
                        "code":272
                    },
                    {
                        "name":"郑州捷祥源汽车销售服务有限公司",
                        "code":273
                    },
                    {
                        "name":"河南合众汇正汽车销售有限公司",
                        "code":274
                    },
                    {
                        "name":"郑州捷祥达汽车销售服务有限公司",
                        "code":275
                    }
                ]
            },
            {
                "name":"周口",
                "code":279,
                "children":[
                    {
                        "name":"周口市和正汽车销售服务有限公司",
                        "code":277
                    },
                    {
                        "name":"周口市和明汽车销售服务有限公司",
                        "code":278
                    }
                ]
            },
            {
                "name":"许昌",
                "code":281,
                "children":[
                    {
                        "name":"许昌恒晟业汽车销售有限公司",
                        "code":280
                    }
                ]
            },
            {
                "name":"商丘",
                "code":285,
                "children":[
                    {
                        "name":"商丘市新捷汽车销售有限公司",
                        "code":282
                    },
                    {
                        "name":"商丘市明德汽车销售有限公司",
                        "code":283
                    },
                    {
                        "name":"永城市新捷汽车销售服务有限公司",
                        "code":284
                    }
                ]
            },
            {
                "name":"新乡",
                "code":288,
                "children":[
                    {
                        "name":"新乡市恩达汽车销售有限公司",
                        "code":286
                    },
                    {
                        "name":"新乡市鸿愿汽车销售有限公司",
                        "code":287
                    }
                ]
            },
            {
                "name":"平顶山",
                "code":290,
                "children":[
                    {
                        "name":"平顶山捷祥源汽车销售服务有限公司",
                        "code":289
                    }
                ]
            },
            {
                "name":"南阳",
                "code":292,
                "children":[
                    {
                        "name":"南阳万通博捷汽车销售服务有限公司",
                        "code":291
                    }
                ]
            },
            {
                "name":"安阳",
                "code":294,
                "children":[
                    {
                        "name":"安阳市众捷汽车贸易有限责任公司",
                        "code":293
                    }
                ]
            },
            {
                "name":"濮阳",
                "code":296,
                "children":[
                    {
                        "name":"濮阳市德捷汽车销售服务有限公司",
                        "code":295
                    }
                ]
            },
            {
                "name":"三门峡",
                "code":298,
                "children":[
                    {
                        "name":"三门峡旗致汽车销售服务有限公司",
                        "code":297
                    }
                ]
            },
            {
                "name":"鹤壁",
                "code":300,
                "children":[
                    {
                        "name":"鹤壁市众捷汽车销售服务有限公司",
                        "code":299
                    }
                ]
            },
            {
                "name":"焦作",
                "code":302,
                "children":[
                    {
                        "name":"焦作市天捷汽车销售服务有限公司",
                        "code":301
                    }
                ]
            },
            {
                "name":"许昌",
                "code":305,
                "children":[
                    {
                        "name":"禹州恒业汽车销售有限公司",
                        "code":303
                    },
                    {
                        "name":"长葛市恒业汽车销售有限公司",
                        "code":304
                    }
                ]
            },
            {
                "name":"信阳",
                "code":307,
                "children":[
                    {
                        "name":"信阳合众致成汽车销售服务有限公司",
                        "code":306
                    }
                ]
            },
            {
                "name":"新乡",
                "code":310,
                "children":[
                    {
                        "name":"长垣世通汽车贸易有限公司",
                        "code":308
                    },
                    {
                        "name":"辉县市世通汽车销售有限公司",
                        "code":309
                    }
                ]
            }
        ]
    },
    {
        "name":"云南",
        "code":339,
        "children":[
            {
                "name":"玉溪",
                "code":313,
                "children":[
                    {
                        "name":"玉溪坤驰汽车销售有限公司",
                        "code":312
                    }
                ]
            },
            {
                "name":"昆明",
                "code":316,
                "children":[
                    {
                        "name":"云南博曜昇众汽车销售服务有限公司",
                        "code":314
                    },
                    {
                        "name":"昆明谊友汽车销售有限公司",
                        "code":315
                    }
                ]
            },
            {
                "name":"保山",
                "code":318,
                "children":[
                    {
                        "name":"保山市恒众汽车销售服务有限公司",
                        "code":317
                    }
                ]
            },
            {
                "name":"临沧",
                "code":320,
                "children":[
                    {
                        "name":"临沧益众汽车服务有限公司",
                        "code":319
                    }
                ]
            },
            {
                "name":"大理",
                "code":322,
                "children":[
                    {
                        "name":"大理裕田汽车销售服务有限公司",
                        "code":321
                    }
                ]
            },
            {
                "name":"文山",
                "code":324,
                "children":[
                    {
                        "name":"文山捷惠永祥汽车销售有限公司",
                        "code":323
                    }
                ]
            },
            {
                "name":"西双版纳",
                "code":326,
                "children":[
                    {
                        "name":"西双版纳兴捷汽车销售服务有限公司",
                        "code":325
                    }
                ]
            },
            {
                "name":"普洱",
                "code":328,
                "children":[
                    {
                        "name":"普洱益众汽车销售服务有限公司",
                        "code":327
                    }
                ]
            },
            {
                "name":"红河",
                "code":330,
                "children":[
                    {
                        "name":"红河捷瑞汽车销售有限公司",
                        "code":329
                    }
                ]
            },
            {
                "name":"曲靖",
                "code":332,
                "children":[
                    {
                        "name":"曲靖添福源福众汽车贸易有限公司",
                        "code":331
                    }
                ]
            },
            {
                "name":"昭通",
                "code":334,
                "children":[
                    {
                        "name":"昭通谊众汽车销售有限公司",
                        "code":333
                    }
                ]
            },
            {
                "name":"德宏",
                "code":336,
                "children":[
                    {
                        "name":"德宏捷泰汽车销售有限公司",
                        "code":335
                    }
                ]
            },
            {
                "name":"丽江",
                "code":338,
                "children":[
                    {
                        "name":"丽江鑫驰骏汽车销售服务有限责任公司",
                        "code":337
                    }
                ]
            }
        ]
    },
    {
        "name":"吉林",
        "code":361,
        "children":[
            {
                "name":"长春",
                "code":344,
                "children":[
                    {
                        "name":"吉林省华之诚洋悦汽车销售有限公司",
                        "code":340
                    },
                    {
                        "name":"吉林省国兴汽车经贸有限公司",
                        "code":341
                    },
                    {
                        "name":"长春汇祥亿达汽车销售服务有限公司",
                        "code":342
                    },
                    {
                        "name":"吉林省华商汽车销售服务有限公司",
                        "code":343
                    }
                ]
            },
            {
                "name":"通化",
                "code":346,
                "children":[
                    {
                        "name":"通化市融展嘉鹏汽车销售服务有限公司",
                        "code":345
                    }
                ]
            },
            {
                "name":"辽源",
                "code":348,
                "children":[
                    {
                        "name":"辽源市耀鑫汽车销售服务有限公司",
                        "code":347
                    }
                ]
            },
            {
                "name":"白城",
                "code":350,
                "children":[
                    {
                        "name":"白城汇达汽车销售服务有限公司",
                        "code":349
                    }
                ]
            },
            {
                "name":"延吉",
                "code":352,
                "children":[
                    {
                        "name":"延吉华之诚昊威汽车销售服务有限公司",
                        "code":351
                    }
                ]
            },
            {
                "name":"四平",
                "code":354,
                "children":[
                    {
                        "name":"四平汇达汽车销售服务有限公司",
                        "code":353
                    }
                ]
            },
            {
                "name":"松原",
                "code":356,
                "children":[
                    {
                        "name":"松原汇达汽车销售服务有限公司",
                        "code":355
                    }
                ]
            },
            {
                "name":"吉林",
                "code":358,
                "children":[
                    {
                        "name":"吉林市神捷汽车销售服务有限公司",
                        "code":357
                    }
                ]
            },
            {
                "name":"白山",
                "code":360,
                "children":[
                    {
                        "name":"白山市众合汽车销售维修有限国内公司",
                        "code":359
                    }
                ]
            }
        ]
    },
    {
        "name":"山东",
        "code":422,
        "children":[
            {
                "name":"潍坊",
                "code":364,
                "children":[
                    {
                        "name":"潍坊广潍通达贸易有限公司",
                        "code":362
                    },
                    {
                        "name":"青州广潍通达汽车销售服务有限公司",
                        "code":363
                    }
                ]
            },
            {
                "name":"济宁",
                "code":367,
                "children":[
                    {
                        "name":"济宁交运怡鑫汽车销售服务有限公司",
                        "code":365
                    },
                    {
                        "name":"济宁众信汽车销售服务有限公司",
                        "code":366
                    }
                ]
            },
            {
                "name":"烟台",
                "code":370,
                "children":[
                    {
                        "name":"烟台市旺源汽车销售服务有限公司",
                        "code":368
                    },
                    {
                        "name":"烟台亿辰汽车俱乐部有限公司",
                        "code":369
                    }
                ]
            },
            {
                "name":"滨州",
                "code":373,
                "children":[
                    {
                        "name":"滨州市金捷汽车销售服务有限公司",
                        "code":371
                    },
                    {
                        "name":"邹平市金凯汽车销售服务有限公司",
                        "code":372
                    }
                ]
            },
            {
                "name":"日照",
                "code":375,
                "children":[
                    {
                        "name":"日照众德汽车销售服务有限公司",
                        "code":374
                    }
                ]
            },
            {
                "name":"德州",
                "code":377,
                "children":[
                    {
                        "name":"夏津金车汇津汽车销售服务有限公司",
                        "code":376
                    }
                ]
            },
            {
                "name":"菏泽",
                "code":380,
                "children":[
                    {
                        "name":"菏泽金泓汽车销售服务有限公司",
                        "code":378
                    },
                    {
                        "name":"菏泽金涌车业有限公司",
                        "code":379
                    }
                ]
            },
            {
                "name":"聊城",
                "code":382,
                "children":[
                    {
                        "name":"聊城北斗恒捷汽车销售有限公司",
                        "code":381
                    }
                ]
            },
            {
                "name":"东营",
                "code":384,
                "children":[
                    {
                        "name":"东营鑫锐达汽车销售服务有限公司",
                        "code":383
                    }
                ]
            },
            {
                "name":"临沂",
                "code":388,
                "children":[
                    {
                        "name":"平邑瑞华汽车销售服务有限公司",
                        "code":385
                    },
                    {
                        "name":"临沂文华汽车销售服务有限公司",
                        "code":386
                    },
                    {
                        "name":"沂水韶华汽车销售服务有限公司",
                        "code":387
                    }
                ]
            },
            {
                "name":"青岛",
                "code":391,
                "children":[
                    {
                        "name":"青岛信和汽车销售有限公司",
                        "code":389
                    },
                    {
                        "name":"青岛同众汽车销售服务有限公司",
                        "code":390
                    }
                ]
            },
            {
                "name":"枣庄",
                "code":393,
                "children":[
                    {
                        "name":"枣庄鲁汇汽车销售服务有限公司",
                        "code":392
                    }
                ]
            },
            {
                "name":"济南",
                "code":397,
                "children":[
                    {
                        "name":"山东成欣汽车贸易有限公司",
                        "code":394
                    },
                    {
                        "name":"山东百瑞汽车销售服务有限公司",
                        "code":395
                    },
                    {
                        "name":"山东金万通汽车销售有限公司",
                        "code":396
                    }
                ]
            },
            {
                "name":"淄博",
                "code":400,
                "children":[
                    {
                        "name":"淄博久通汽车维修服务有限公司",
                        "code":398
                    },
                    {
                        "name":"淄博齐之福汽车销售有限公司",
                        "code":399
                    }
                ]
            },
            {
                "name":"泰安",
                "code":402,
                "children":[
                    {
                        "name":"泰安金岳骏捷汽车销售服务有限公司",
                        "code":401
                    }
                ]
            },
            {
                "name":"威海",
                "code":404,
                "children":[
                    {
                        "name":"威海远誉汽车销售服务有限公司",
                        "code":403
                    }
                ]
            },
            {
                "name":"临沂",
                "code":414,
                "children":[
                    {
                        "name":"莒南德华汽车销售服务有限公司",
                        "code":405
                    },
                    {
                        "name":"兰陵大华汽车销售服务有限公司",
                        "code":406
                    },
                    {
                        "name":"临沂德华汽车销售服务有限公司",
                        "code":407
                    },
                    {
                        "name":"费县大华汽车销售服务有限公司",
                        "code":408
                    },
                    {
                        "name":"临沂大华汽车销售服务有限公司",
                        "code":409
                    },
                    {
                        "name":"临沭东华汽车销售服务有限公司",
                        "code":410
                    },
                    {
                        "name":"沂南大华汽车销售服务有限公司",
                        "code":411
                    },
                    {
                        "name":"临沂久华汽车销售服务有限公司",
                        "code":412
                    },
                    {
                        "name":"郯城大华汽车销售服务有限公司",
                        "code":413
                    }
                ]
            },
            {
                "name":"菏泽",
                "code":416,
                "children":[
                    {
                        "name":"菏泽金浤车业有限公司",
                        "code":415
                    }
                ]
            },
            {
                "name":"枣庄",
                "code":418,
                "children":[
                    {
                        "name":"山东永正集团东联汽车城有限公司",
                        "code":417
                    }
                ]
            },
            {
                "name":"潍坊",
                "code":421,
                "children":[
                    {
                        "name":"临朐广潍顺达汽车销售服务有限公司",
                        "code":419
                    },
                    {
                        "name":"昌邑广潍金达汽车销售服务有限公司",
                        "code":420
                    }
                ]
            }
        ]
    },
    {
        "name":"辽宁",
        "code":453,
        "children":[
            {
                "name":"锦州",
                "code":424,
                "children":[
                    {
                        "name":"锦州川达捷昇汽车销售服务有限公司",
                        "code":423
                    }
                ]
            },
            {
                "name":"鞍山",
                "code":426,
                "children":[
                    {
                        "name":"鞍山新生达汽车销售有限公司",
                        "code":425
                    }
                ]
            },
            {
                "name":"大连",
                "code":429,
                "children":[
                    {
                        "name":"大连华诺汽车贸易有限公司",
                        "code":427
                    },
                    {
                        "name":"瓦房店立博贸易有限公司",
                        "code":428
                    }
                ]
            },
            {
                "name":"葫芦岛",
                "code":431,
                "children":[
                    {
                        "name":"辽宁川通汽车修理服务有限公司",
                        "code":430
                    }
                ]
            },
            {
                "name":"朝阳",
                "code":433,
                "children":[
                    {
                        "name":"朝阳川达汽车销售有限公司",
                        "code":432
                    }
                ]
            },
            {
                "name":"营口",
                "code":435,
                "children":[
                    {
                        "name":"营口红运瑞众汽车销售服务有限公司",
                        "code":434
                    }
                ]
            },
            {
                "name":"阜新",
                "code":437,
                "children":[
                    {
                        "name":"阜新达兴汽车销售服务有限公司",
                        "code":436
                    }
                ]
            },
            {
                "name":"沈阳",
                "code":440,
                "children":[
                    {
                        "name":"辽宁润兴汽车销售服务有限公司",
                        "code":438
                    },
                    {
                        "name":"沈阳捷众汽车销售服务有限公司",
                        "code":439
                    }
                ]
            },
            {
                "name":"盘锦",
                "code":442,
                "children":[
                    {
                        "name":"盘锦伯驹汽车销售服务有限公司",
                        "code":441
                    }
                ]
            },
            {
                "name":"抚顺",
                "code":444,
                "children":[
                    {
                        "name":"抚顺志兴汽车销售服务有限公司",
                        "code":443
                    }
                ]
            },
            {
                "name":"营口",
                "code":446,
                "children":[
                    {
                        "name":"营口红运顺众汽车销售服务有限公司",
                        "code":445
                    }
                ]
            },
            {
                "name":"铁岭",
                "code":448,
                "children":[
                    {
                        "name":"铁岭承兴汽车销售服务有限公司",
                        "code":447
                    }
                ]
            },
            {
                "name":"辽阳",
                "code":450,
                "children":[
                    {
                        "name":"辽阳凯达汽车销售服务有限公司",
                        "code":449
                    }
                ]
            },
            {
                "name":"本溪",
                "code":452,
                "children":[
                    {
                        "name":"辽宁惠华集团本溪汽车销售服务有限公司",
                        "code":451
                    }
                ]
            }
        ]
    },
    {
        "name":"湖南",
        "code":481,
        "children":[
            {
                "name":"邵阳",
                "code":455,
                "children":[
                    {
                        "name":"邵阳达美捷众汽车销售服务有限公司",
                        "code":454
                    }
                ]
            },
            {
                "name":"娄底",
                "code":457,
                "children":[
                    {
                        "name":"娄底达美捷众汽车贸易有限公司",
                        "code":456
                    }
                ]
            },
            {
                "name":"常德",
                "code":459,
                "children":[
                    {
                        "name":"常德裕生捷汽车服务有限公司",
                        "code":458
                    }
                ]
            },
            {
                "name":"怀化",
                "code":461,
                "children":[
                    {
                        "name":"怀化德广汽车销售服务有限公司",
                        "code":460
                    }
                ]
            },
            {
                "name":"长沙",
                "code":464,
                "children":[
                    {
                        "name":"湖南捷之信汽车销售有限公司",
                        "code":462
                    },
                    {
                        "name":"湖南兰天天达汽车销售有限公司",
                        "code":463
                    }
                ]
            },
            {
                "name":"衡阳",
                "code":466,
                "children":[
                    {
                        "name":"衡阳捷之兴汽车销售有限公司",
                        "code":465
                    }
                ]
            },
            {
                "name":"郴州",
                "code":468,
                "children":[
                    {
                        "name":"郴州致捷汽车销售服务有限公司",
                        "code":467
                    }
                ]
            },
            {
                "name":"岳阳",
                "code":470,
                "children":[
                    {
                        "name":"岳阳盛达汽车销售服务有限公司",
                        "code":469
                    }
                ]
            },
            {
                "name":"株洲",
                "code":472,
                "children":[
                    {
                        "name":"株洲宏旺汽车销售服务有限公司",
                        "code":471
                    }
                ]
            },
            {
                "name":"湘潭",
                "code":474,
                "children":[
                    {
                        "name":"湘潭捷众汽车销售服务有限公司",
                        "code":473
                    }
                ]
            },
            {
                "name":"永州",
                "code":476,
                "children":[
                    {
                        "name":"永州益捷汽车服务有限公司",
                        "code":475
                    }
                ]
            },
            {
                "name":"益阳",
                "code":478,
                "children":[
                    {
                        "name":"益阳晓园汽车销售服务有限公司",
                        "code":477
                    }
                ]
            },
            {
                "name":"邵阳",
                "code":480,
                "children":[
                    {
                        "name":"邵阳大汉汽车贸易有限公司",
                        "code":479
                    }
                ]
            }
        ]
    },
    {
        "name":"福建",
        "code":509,
        "children":[
            {
                "name":"泉州",
                "code":483,
                "children":[
                    {
                        "name":"泉州明车贸易有限公司",
                        "code":482
                    }
                ]
            },
            {
                "name":"莆田",
                "code":485,
                "children":[
                    {
                        "name":"莆田捷奇汽车销售服务有限公司",
                        "code":484
                    }
                ]
            },
            {
                "name":"三明",
                "code":487,
                "children":[
                    {
                        "name":"三明市成捷汽车销售服务有限公司",
                        "code":486
                    }
                ]
            },
            {
                "name":"福州",
                "code":489,
                "children":[
                    {
                        "name":"福州明车贸易有限公司",
                        "code":488
                    }
                ]
            },
            {
                "name":"厦门",
                "code":491,
                "children":[
                    {
                        "name":"厦门明车贸易有限公司",
                        "code":490
                    }
                ]
            },
            {
                "name":"漳州",
                "code":493,
                "children":[
                    {
                        "name":"漳州明车贸易有限公司",
                        "code":492
                    }
                ]
            },
            {
                "name":"福州",
                "code":495,
                "children":[
                    {
                        "name":"福州致远汽车销售服务有限公司",
                        "code":494
                    }
                ]
            },
            {
                "name":"泉州",
                "code":497,
                "children":[
                    {
                        "name":"惠安盈众汽车销售服务有限公司",
                        "code":496
                    }
                ]
            },
            {
                "name":"厦门",
                "code":502,
                "children":[
                    {
                        "name":"厦门君达汽车有限公司",
                        "code":498
                    },
                    {
                        "name":"厦门市盈众汽车销售有限公司",
                        "code":499
                    },
                    {
                        "name":"厦门市海沧盈众汽车有限公司",
                        "code":500
                    },
                    {
                        "name":"厦门致远汽车有限公司",
                        "code":501
                    }
                ]
            },
            {
                "name":"龙岩",
                "code":504,
                "children":[
                    {
                        "name":"龙岩明车贸易有限公司",
                        "code":503
                    }
                ]
            },
            {
                "name":"南平",
                "code":506,
                "children":[
                    {
                        "name":"南平明车贸易有限公司",
                        "code":505
                    }
                ]
            },
            {
                "name":"宁德",
                "code":508,
                "children":[
                    {
                        "name":"宁德盈众汽车有限公司",
                        "code":507
                    }
                ]
            }
        ]
    },
    {
        "name":"北京",
        "code":513,
        "children":[
            {
                "name":"北京",
                "code":512,
                "children":[
                    {
                        "name":"北京鑫万维顺达汽车销售有限公司",
                        "code":510
                    },
                    {
                        "name":"北京捷亚泰博兴汽车销售有限公司",
                        "code":511
                    }
                ]
            }
        ]
    },
    {
        "name":"陕西",
        "code":560,
        "children":[
            {
                "name":"长治",
                "code":515,
                "children":[
                    {
                        "name":"长治市飞路达汽车销售服务有限公司",
                        "code":514
                    }
                ]
            },
            {
                "name":"咸阳",
                "code":517,
                "children":[
                    {
                        "name":"陕西恒睿汽贸有限公司",
                        "code":516
                    }
                ]
            },
            {
                "name":"延安",
                "code":519,
                "children":[
                    {
                        "name":"延安捷之泰汽贸有限责任公司",
                        "code":518
                    }
                ]
            },
            {
                "name":"西安",
                "code":522,
                "children":[
                    {
                        "name":"西安捷祥源汽车销售服务有限公司",
                        "code":520
                    },
                    {
                        "name":"西安鹰之杰尊荣汽车销售有限公司",
                        "code":521
                    }
                ]
            },
            {
                "name":"宝鸡",
                "code":524,
                "children":[
                    {
                        "name":"宝鸡福德纳汽车销售服务有限公司",
                        "code":523
                    }
                ]
            },
            {
                "name":"阳泉",
                "code":526,
                "children":[
                    {
                        "name":"阳泉市捷鑫汽车销售有限公司",
                        "code":525
                    }
                ]
            },
            {
                "name":"汉中",
                "code":528,
                "children":[
                    {
                        "name":"汉中瑞捷汽车销售服务有限公司",
                        "code":527
                    }
                ]
            },
            {
                "name":"运城",
                "code":530,
                "children":[
                    {
                        "name":"运城市瑞宝汽车销售服务有限公司",
                        "code":529
                    }
                ]
            },
            {
                "name":"吕梁",
                "code":532,
                "children":[
                    {
                        "name":"山西省吕梁市大昌汽车贸易有限公司",
                        "code":531
                    }
                ]
            },
            {
                "name":"太原",
                "code":535,
                "children":[
                    {
                        "name":"山西中盛瑞泽贸易有限公司",
                        "code":533
                    },
                    {
                        "name":"太原海联捷丰汽车销售服务有限公司",
                        "code":534
                    }
                ]
            },
            {
                "name":"大同",
                "code":537,
                "children":[
                    {
                        "name":"大同市顺旺汽车服务有限公司",
                        "code":536
                    }
                ]
            },
            {
                "name":"榆林",
                "code":539,
                "children":[
                    {
                        "name":"榆林市恒祥汽贸有限公司",
                        "code":538
                    }
                ]
            },
            {
                "name":"朔州",
                "code":541,
                "children":[
                    {
                        "name":"朔州市双良惠众汽车有限公司",
                        "code":540
                    }
                ]
            },
            {
                "name":"忻州",
                "code":543,
                "children":[
                    {
                        "name":"忻州大昌轿车销售有限公司",
                        "code":542
                    }
                ]
            },
            {
                "name":"临汾",
                "code":545,
                "children":[
                    {
                        "name":"临汾海通汽车销售有限公司",
                        "code":544
                    }
                ]
            },
            {
                "name":"晋城",
                "code":547,
                "children":[
                    {
                        "name":"晋城海联捷成汽车销售服务有限公司",
                        "code":546
                    }
                ]
            },
            {
                "name":"晋中",
                "code":549,
                "children":[
                    {
                        "name":"晋中市金悦汽车服务有限公司",
                        "code":548
                    }
                ]
            },
            {
                "name":"榆林",
                "code":552,
                "children":[
                    {
                        "name":"府谷县恒捷汽贸有限公司",
                        "code":550
                    },
                    {
                        "name":"靖边县恒博汽贸有限公司",
                        "code":551
                    }
                ]
            },
            {
                "name":"咸阳",
                "code":554,
                "children":[
                    {
                        "name":"咸阳恒源汽贸有限公司",
                        "code":553
                    }
                ]
            },
            {
                "name":"渭南",
                "code":557,
                "children":[
                    {
                        "name":"渭南恒盛捷达汽贸有限公司",
                        "code":555
                    },
                    {
                        "name":"渭南恒盛德丰汽贸有限公司",
                        "code":556
                    }
                ]
            },
            {
                "name":"铜川",
                "code":559,
                "children":[
                    {
                        "name":"铜川捷泰汽贸有限责任公司",
                        "code":558
                    }
                ]
            }
        ]
    },
    {
        "name":"湖北",
        "code":592,
        "children":[
            {
                "name":"襄阳",
                "code":562,
                "children":[
                    {
                        "name":"襄阳东富百捷汽车销售服务有限公司",
                        "code":561
                    }
                ]
            },
            {
                "name":"宜昌",
                "code":564,
                "children":[
                    {
                        "name":"宜昌和顺汽车销售服务有限公司",
                        "code":563
                    }
                ]
            },
            {
                "name":"荆门",
                "code":566,
                "children":[
                    {
                        "name":"荆门东富百捷汽车销售服务有限公司",
                        "code":565
                    }
                ]
            },
            {
                "name":"十堰",
                "code":568,
                "children":[
                    {
                        "name":"十堰东富百捷汽车销售服务有限公司",
                        "code":567
                    }
                ]
            },
            {
                "name":"武汉",
                "code":571,
                "children":[
                    {
                        "name":"武汉东富百捷汽车销售服务有限公司",
                        "code":569
                    },
                    {
                        "name":"武汉东富千捷汽车销售服务有限公司",
                        "code":570
                    }
                ]
            },
            {
                "name":"黄石",
                "code":573,
                "children":[
                    {
                        "name":"黄石市鑫辰汽车销售服务有限公司",
                        "code":572
                    }
                ]
            },
            {
                "name":"黄冈",
                "code":575,
                "children":[
                    {
                        "name":"黄冈捷诚汽车服务有限公司",
                        "code":574
                    }
                ]
            },
            {
                "name":"随州",
                "code":577,
                "children":[
                    {
                        "name":"随州东富千捷汽车销售服务有限公司",
                        "code":576
                    }
                ]
            },
            {
                "name":"恩施",
                "code":579,
                "children":[
                    {
                        "name":"恩施汇鑫达汽车销售服务有限公司",
                        "code":578
                    }
                ]
            },
            {
                "name":"孝感",
                "code":581,
                "children":[
                    {
                        "name":"孝感国星汽车销售服务有限公司",
                        "code":580
                    }
                ]
            },
            {
                "name":"天门",
                "code":583,
                "children":[
                    {
                        "name":"天门爱捷汽车销售服务有限公司",
                        "code":582
                    }
                ]
            },
            {
                "name":"咸宁",
                "code":585,
                "children":[
                    {
                        "name":"咸宁东旗汽车销售服务有限公司",
                        "code":584
                    }
                ]
            },
            {
                "name":"潜江",
                "code":587,
                "children":[
                    {
                        "name":"潜江益众汽车销售服务有限公司",
                        "code":586
                    }
                ]
            },
            {
                "name":"武汉",
                "code":589,
                "children":[
                    {
                        "name":"武汉富尔汽车销售服务有限公司",
                        "code":588
                    }
                ]
            },
            {
                "name":"荆州",
                "code":591,
                "children":[
                    {
                        "name":"荆州益华汽车销售服务有限公司",
                        "code":590
                    }
                ]
            }
        ]
    },
    {
        "name":"天津",
        "code":598,
        "children":[
            {
                "name":"天津",
                "code":597,
                "children":[
                    {
                        "name":"天津恒泰通汽车销售有限公司",
                        "code":593
                    },
                    {
                        "name":"天津通达津宝汽车维修服务有限公司",
                        "code":594
                    },
                    {
                        "name":"天津瀛众汽车销售有限公司",
                        "code":595
                    },
                    {
                        "name":"天津恒信通汽车销售有限公司",
                        "code":596
                    }
                ]
            }
        ]
    },
    {
        "name":"安徽",
        "code":623,
        "children":[
            {
                "name":"阜阳",
                "code":600,
                "children":[
                    {
                        "name":"阜阳市永众汽车销售服务有限公司",
                        "code":599
                    }
                ]
            },
            {
                "name":"蚌埠",
                "code":602,
                "children":[
                    {
                        "name":"蚌埠市涌润汽车销售服务有限公司",
                        "code":601
                    }
                ]
            },
            {
                "name":"宿州",
                "code":604,
                "children":[
                    {
                        "name":"宿州市晟源汽车销售服务有限公司",
                        "code":603
                    }
                ]
            },
            {
                "name":"六安",
                "code":606,
                "children":[
                    {
                        "name":"六安和新汽车销售服务有限责任公司",
                        "code":605
                    }
                ]
            },
            {
                "name":"合肥",
                "code":608,
                "children":[
                    {
                        "name":"安徽捷众汽车销售服务有限公司",
                        "code":607
                    }
                ]
            },
            {
                "name":"亳州",
                "code":610,
                "children":[
                    {
                        "name":"亳州市盛欣汽车销售服务有限公司",
                        "code":609
                    }
                ]
            },
            {
                "name":"滁州",
                "code":612,
                "children":[
                    {
                        "name":"滁州华众力捷汽车销售服务有限公司",
                        "code":611
                    }
                ]
            },
            {
                "name":"马鞍山",
                "code":614,
                "children":[
                    {
                        "name":"马鞍山润中汽车服务有限公司",
                        "code":613
                    }
                ]
            },
            {
                "name":"淮南",
                "code":616,
                "children":[
                    {
                        "name":"淮南盛州汽车销售服务有限公司",
                        "code":615
                    }
                ]
            },
            {
                "name":"安庆",
                "code":618,
                "children":[
                    {
                        "name":"安庆市众捷汽车销售服务有限公司",
                        "code":617
                    }
                ]
            },
            {
                "name":"阜阳",
                "code":620,
                "children":[
                    {
                        "name":"阜阳永迪汽车销售服务有限公司",
                        "code":619
                    }
                ]
            },
            {
                "name":"淮北",
                "code":622,
                "children":[
                    {
                        "name":"淮北市晟昌汽车销售服务有限责任公司",
                        "code":621
                    }
                ]
            }
        ]
    },
    {
        "name":"上海",
        "code":630,
        "children":[
            {
                "name":"上海",
                "code":627,
                "children":[
                    {
                        "name":"上海华星鸿驰汽车销售服务有限公司",
                        "code":624
                    },
                    {
                        "name":"上海华星鸿全汽车销售服务有限公司",
                        "code":625
                    },
                    {
                        "name":"上海华星鸿通汽车销售服务有限公司",
                        "code":626
                    }
                ]
            },
            {
                "name":"上海",
                "code":629,
                "children":[
                    {
                        "name":"上海华星鸿捷汽车销售服务有限公司",
                        "code":628
                    }
                ]
            }
        ]
    },
    {
        "name":"重庆",
        "code":636,
        "children":[
            {
                "name":"重庆",
                "code":635,
                "children":[
                    {
                        "name":"重庆万家众信汽车销售服务有限公司",
                        "code":631
                    },
                    {
                        "name":"重庆慧禹汽车销售服务有限公司",
                        "code":632
                    },
                    {
                        "name":"重庆宇德汽车销售有限公司",
                        "code":633
                    },
                    {
                        "name":"重庆绚腾汽车销售服务有限公司",
                        "code":634
                    }
                ]
            }
        ]
    },
    {
        "name":"甘肃",
        "code":653,
        "children":[
            {
                "name":"平凉",
                "code":638,
                "children":[
                    {
                        "name":"平凉润捷安达汽车贸易有限责任公司",
                        "code":637
                    }
                ]
            },
            {
                "name":"兰州",
                "code":640,
                "children":[
                    {
                        "name":"兰州金岛瑞达汽车销售服务有限公司",
                        "code":639
                    }
                ]
            },
            {
                "name":"武威",
                "code":642,
                "children":[
                    {
                        "name":"武威市永凯瑞汽车贸易有限公司",
                        "code":641
                    }
                ]
            },
            {
                "name":"天水",
                "code":644,
                "children":[
                    {
                        "name":"天水天合华捷汽车销售服务有限公司",
                        "code":643
                    }
                ]
            },
            {
                "name":"白银",
                "code":646,
                "children":[
                    {
                        "name":"白银易成汽车销售有限公司",
                        "code":645
                    }
                ]
            },
            {
                "name":"张掖",
                "code":648,
                "children":[
                    {
                        "name":"张掖金岛恒达汽车销售服务有限公司",
                        "code":647
                    }
                ]
            },
            {
                "name":"金昌",
                "code":650,
                "children":[
                    {
                        "name":"金昌赛亚汇通汽车销售服务有限公司",
                        "code":649
                    }
                ]
            },
            {
                "name":"酒泉",
                "code":652,
                "children":[
                    {
                        "name":"酒泉金岛诚达汽车销售服务有限公司",
                        "code":651
                    }
                ]
            }
        ]
    },
    {
        "name":"新疆",
        "code":666,
        "children":[
            {
                "name":"阿克苏",
                "code":655,
                "children":[
                    {
                        "name":"阿克苏博众汽车销售有限公司",
                        "code":654
                    }
                ]
            },
            {
                "name":"伊犁",
                "code":657,
                "children":[
                    {
                        "name":"伊犁伊运汽车销售服务有限公司",
                        "code":656
                    }
                ]
            },
            {
                "name":"乌鲁木齐",
                "code":659,
                "children":[
                    {
                        "name":"新疆天汇鑫瑞达汽车销售服务有限公司",
                        "code":658
                    }
                ]
            },
            {
                "name":"巴音郭楞",
                "code":661,
                "children":[
                    {
                        "name":"巴州万禾博众汽车销售有限公司",
                        "code":660
                    }
                ]
            },
            {
                "name":"喀什",
                "code":663,
                "children":[
                    {
                        "name":"喀什通工众捷汽车销售服务有限公司",
                        "code":662
                    }
                ]
            },
            {
                "name":"昌吉",
                "code":665,
                "children":[
                    {
                        "name":"昌吉骏腾瑞欣汽车销售有限公司",
                        "code":664
                    }
                ]
            }
        ]
    },
    {
        "name":"宁夏",
        "code":669,
        "children":[
            {
                "name":"银川",
                "code":668,
                "children":[
                    {
                        "name":"宁夏瑞泰嘉达汽车销售有限责任公司",
                        "code":667
                    }
                ]
            }
        ]
    },
    {
        "name":"江西",
        "code":682,
        "children":[
            {
                "name":"吉安",
                "code":671,
                "children":[
                    {
                        "name":"吉安易轩锦汽车销售服务有限公司",
                        "code":670
                    }
                ]
            },
            {
                "name":"上饶",
                "code":673,
                "children":[
                    {
                        "name":"上饶市欧亚豪胜汽车服务有限公司",
                        "code":672
                    }
                ]
            },
            {
                "name":"萍乡",
                "code":675,
                "children":[
                    {
                        "name":"萍乡金昌实业有限公司",
                        "code":674
                    }
                ]
            },
            {
                "name":"赣州",
                "code":677,
                "children":[
                    {
                        "name":"赣州融合汽车销售服务有限公司",
                        "code":676
                    }
                ]
            },
            {
                "name":"南昌",
                "code":679,
                "children":[
                    {
                        "name":"江西众捷汽车服务有限公司",
                        "code":678
                    }
                ]
            },
            {
                "name":"宜春",
                "code":681,
                "children":[
                    {
                        "name":"宜春益众汽车贸易有限公司",
                        "code":680
                    }
                ]
            }
        ]
    },
    {
        "name":"广西",
        "code":701,
        "children":[
            {
                "name":"柳州",
                "code":685,
                "children":[
                    {
                        "name":"柳州华柳华腾汽车销售服务有限公司",
                        "code":683
                    },
                    {
                        "name":"柳州华柳华达汽车销售服务有限公司",
                        "code":684
                    }
                ]
            },
            {
                "name":"贵港",
                "code":687,
                "children":[
                    {
                        "name":"广西贵港丰裕汽车销售服务有限公司",
                        "code":686
                    }
                ]
            },
            {
                "name":"桂林",
                "code":689,
                "children":[
                    {
                        "name":"桂林华众达汽车销售有限公司",
                        "code":688
                    }
                ]
            },
            {
                "name":"南宁",
                "code":692,
                "children":[
                    {
                        "name":"广西钜荣粤桂汽车贸易有限公司",
                        "code":690
                    },
                    {
                        "name":"广西钜荣粤桂汽车有限公司",
                        "code":691
                    }
                ]
            },
            {
                "name":"玉林",
                "code":694,
                "children":[
                    {
                        "name":"玉林优步汽车销售服务有限公司",
                        "code":693
                    }
                ]
            },
            {
                "name":"防城港",
                "code":696,
                "children":[
                    {
                        "name":"广西防城港丰捷汽车销售服务有限公司",
                        "code":695
                    }
                ]
            },
            {
                "name":"百色",
                "code":698,
                "children":[
                    {
                        "name":"广西百色丰裕汽车销售服务有限公司",
                        "code":697
                    }
                ]
            },
            {
                "name":"钦州",
                "code":700,
                "children":[
                    {
                        "name":"钦州祥辰汽车销售服务有限公司",
                        "code":699
                    }
                ]
            }
        ]
    },
    {
        "name":"西藏",
        "code":704,
        "children":[
            {
                "name":"拉萨",
                "code":703,
                "children":[
                    {
                        "name":"拉萨康捷汽车销售服务有限公司",
                        "code":702
                    }
                ]
            }
        ]
    }
]
